<?php

namespace App\Telegram;

use DefStudio\Telegraph\Facades\Telegraph;
use DefStudio\Telegraph\Handlers\WebhookHandler;
use DefStudio\Telegraph\Keyboard\Button;
use DefStudio\Telegraph\Keyboard\Keyboard;
use Illuminate\Support\Stringable;

class Handler extends WebhookHandler
{
    public function handleUnknownCommand(Stringable $text): void
    {
        if ($text->value() != Telegraph::getRegisteredCommands()){
            $this->reply("Такої команди я не знаю.🤔\nСкористуйся однією з тих, що доступні за командою /help");
        }
    }
    public function dice(){
        $this->reply("Зараз кину, дай потрясти!");
        sleep(2);
        $this->chat->dice()->send();
    }

    public function start(){
        $this->reply("Привіт!👋 Я бот <b>GUD_E</b>! \n\nУ мене ще набагато функцій, але я розвиваюсь. \n\nПоки ти можешь подивитися все, що мені відомо за командою /help");
    }

    public function help(){
        $this->reply("Показую всі команди, які мені наразі відомі:\n\n /help - показую усі доступні команди \n /site - показую усі посилання на сайт \n /units - показую усіх юнітів \n /fractions - показую усі фракції \n /components - показую усі компоненти \n /dice - кидаю кубик");
    }

    public function site(){
        $this->chat->message('Оберіть посилання за яким треба перейти')
            ->keyboard(Keyboard::make()->buttons([
            Button::make('Перейти на сайт')->url('http://127.0.0.1:8000/ua')->width(1),
            Button::make('Перейти до правил')->url('http://127.0.0.1:8000/ua/rules')->width(0.5),
            Button::make('Перейти до списку юнітів')->url('http://127.0.0.1:8000/ua/units')->width(0.5),
            Button::make('Перейти до списку компонентів')->url('http://127.0.0.1:8000/ua/components')->width(0.5),
            Button::make('Перейти до списку фракцій')->url('http://127.0.0.1:8000/ua/fractions')->width(0.5),
        ]))->send();
    }

    public function units(){
        $this->chat->message('Оберіть юніта по якому треба опис:')
            ->keyboard(Keyboard::make()->buttons([
                Button::make('Стрілець')->action('rifleman'),
                Button::make('Штурмовик')->action('stormtrooper'),
                Button::make('Скаут')->action('scout'),
                Button::make('Снайпер')->action('sniper'),
                Button::make('Кулеметник')->action('machinegunner'),
                Button::make('Пілот')->action('pilot'),
                Button::make('Командир артилерії')->action('artycommander'),
            ]))->send();
    }
    public function rifleman(){
        $this->chat->message("<i>Стрілець</i> володіє тільки гвинтівкою і ножем. Має 10 од. здоров'я і броні. Боєзапас розрахований на 10 пострілів, стріляє одинично. Дальність максимального пострілу 8 гексів.")
        ->send();
    }
    public function stormtrooper(){
        $this->chat->message("<i>Штурмовик</i> володіє гвинтівкою, ножем та гранатою. Має 10 од. здоров'я та броні. Боєзапас розрахований на 10 пострілів та на 1 кидок гранати, стріляє одинично. Дальність максимального ураження 8 гексів, дальність максимального кидка гранати 3 гекса. Юніт не може в один хід кинути гранату та зробити постріл, потрібно обрати щось одне. \n\n<b>Примітка</b>: Граната може завдавати массованого пошкодження. Вона завдасть максимального пошкодження, якщо була використана проти одного юніта. Якщо ж, вона була використана проти кількох юнітів, то сусідні від основного ворожого юніту отримають половину пошкодження від пошкодження першого. \n\n<b>Приклад</b>: Якщо ви кидаєте гранату в трьох юнітів (цілючись в центрального) і на кубику випадає 5, то центральний отримує всі 5 очок пошкодження, а сусідні з ним отримують 3 очок пошкодження (через округлення до більшої цифри).")
            ->send();
    }
    public function scout(){
        $this->chat->message("<i>Скаут</i> володіє автоматом і ножем. Має 10 од. здоров'я і броні. Боєкомплект розрахований на 10 пострілів чергами по 1 пострілу. Максимальна дальність ураження становить 5 гексів. Має здатність розподіляти шкоду між юнітиами, якщо вони знаходяться в зоні ураження. \n\n<b>Приклад</b>: Ви воюєте проти групи з трьох ворожих юнітів. Коли ви кидаєте кубик, вам випадає 5. Тепер у вас є можливість розподілити цю шкоду між усіма ворогами, якщо вони знаходяться поруч один з одним. Наприклад, першому - 2 од. шкоди, другому - 2 од. шкоди, третьому - 1 од. шкоди. При цьому потрібно пам\'ятати, що вони повинні знаходитися на гексах, прилеглих до основної ворожої цілі, а сама ця ціль повинна знаходитися на одній лінії з вашим юнітом.")
            ->send();
    }
    public function sniper(){
        $this->chat->message("<i>Снайпер</i> належить до <b>спеціальних юнітів</b>. Володіє снайперською гвинтівкою і ножем. Має 10 од. здоров'я та броні. Боєкомплект розрахований на 10 пострілів, стріляє одинично. Максимальна дальність ураження 12 гексів. Має здатність вразити супротивника, не кидаючи кубика на точність.")
            ->send();
    }
    public function machinegunner(){
        $this->chat->message("<i>Кулеметник</i> належить до <b>спеціальних юнітів</b>. Володіє кулеметом та ножем. Має 10 од. здоров'я та броні. Боєзапас розрахований на 10 пострілів чергами, використовуючи 1 од. боєзапасу. Максимальна дальність ураження 4 гексів. Має здатність завдавати подвійної шкоди одному ворогу або наносити звичайну шкоду кільком ворогам. \n\n<b>Приклад</b>: Ви воюєте проти групи з трьох ворожих юнітів. Коли ви кидаєте кубик, вам випадає 5. Тепер ви маєте вибір: задублювати цифру і нанести 12 од. пошкодження по будь-якому ворожому юніту, або нанести по 6 од. пошкодження всім трьом юнітам. При цьому потрібно пам\'ятати, що вони повинні знаходитися на гексах, прилеглих до основної ворожої цілі, а сама ця ціль повинна знаходитися на одній лінії з вашим юнітом.")
            ->send();
    }
    public function pilot(){
        $this->chat->message("<i>Пілот</i> належить до <b>додаткових юнітів</b>. Володіє пістолетом і ножем. Має 10 очок здоров'я. Боєприпас розрахований на 1 постріл, стріляє одинично. Максимальна дальність ураження становить 5 гексів. Має можливість викликати авіаудар з аеродрому (див. нижче) у будь-яку точку на карті кампанії. Авіаудар виконується по 1 або більше гексів у ряд, залежно від числа на кинутому кубику. Завдає 4 од. пошкодження тим гексам, які були обрані. Після використання своєї здатності пілот зникає з карти кампанії.")
            ->send();
    }
    public function artycommander(){
        $this->chat->message("<i>Командир артилерії</i> належить до <b>додаткови юнітів</b>. Володіє пістолетом і ножем. Має 10 очок здоров'я. Боєприпас розрахований на 1 постріл, стріляє одинично. Максимальна дальність ураження становить 5 гексів. Має можливість викликати артилерійський удар з артилерійського центру (див. нижче) у будь-яку точку на карті кампанії. Артилерійський удар завдає 6 од. пошкоджень обраному вами гексу та 4 од. пошкоджень гаксам, які з ним контактують.")
            ->send();
    }

    public function fractions(){
        $this->chat->message('Оберіть фракції по яким треба опис:')
            ->keyboard(Keyboard::make()->buttons([
                Button::make('🇩🇪 Німеччина')->action('germany')->width(0.5),
                Button::make('🇫🇷 Франція')->action('france')->width(0.5),
                Button::make('🇮🇹 Італія')->action('italy')->width(0.5),
                Button::make('🏴󠁧󠁢󠁥󠁮󠁧󠁿 Англія')->action('england')->width(0.5),
//                Button::make('🇺🇸 Америка')->action('usa')->width(0.5),
//                Button::make('🇨🇳 Китай')->action('china')->width(0.5),
//                Button::make('🇯🇵 Японія')->action('japan')->width(0.5),
//                Button::make('🇰🇵 Північна Корея')->action('nKorea')->width(0.5),
//                Button::make('🇮🇳 Індія')->action('india')->width(0.5),
//                Button::make('🇲🇽 Мексика')->action('mexico')->width(0.5),
//                Button::make('🇮🇱 Ізраїль')->action('israel')->width(0.5),
//                Button::make('🇹🇳 Туніс')->action('tunis')->width(0.5),
//                Button::make('🇲🇳 Монголія')->action('mongolia')->width(0.5),
//                Button::make('🇹🇷 Туреччина')->action('turkey')->width(0.5),
//                Button::make('🇺🇦 Україна')->action('ukraine')->width(0.5),
//                Button::make('🇬🇪 Грузія')->action('georgia')->width(0.5),
//                Button::make('🇪🇸 Іспанія')->action('spain')->width(0.5),
//                Button::make('🇧🇷 Бразилія')->action('brazil')->width(0.5),
//                Button::make('🇨🇭 Швейцарія')->action('switz')->width(0.5),
//                Button::make('🇪🇬 Єгипет')->action('egypt')->width(0.5),
            ]))->send();
    }

    public function germany(){
        $this->chat->message("<i>Бліцкріг</i>: Має змогу кидати кубик на переміщення два рази. \n\n<i>Акт капітуляції</i>: Передайте 3 од. броні і 3 од. боєприпасів (викресліть вказану кількість у ваших юнітів) наступним 3 гравцям (по 1 од. параметру кожному гравцю). Картка скидається у відбій.")
            ->send();
    }
    public function france(){
        $this->chat->message("<i>Народження Наполеона</i>: Будь-який базовий юніт має змогу отримати здібності командира артилерії, діставшись артилерійського центру. Тепер він має змогу викликати артобстріл раз в 5 фаз. При цьому юніт не зникає з карти кампанії. \n\n<i>Білий прапор</i>: Всі території переходять під контроль Німеччини. Якщо такої країни немає в грі, особливість отримує сусід праворуч. Картка скидається у відбій.")
            ->send();
    }
    public function italy(){
        $this->chat->message("<i>Папська влада</i>: Перші два райони, які були захоплені, завжди будуть залишатися під контролем Італії. \n\n<i>Доля мафії</i>: З цього моменту будь-яке поповнення боєприпасів знижено на 2 од. Картка викладається на стіл перед гравцем цієї фракції і залишається до кінця гри.")
            ->send();
    }
    public function england(){
        $this->chat->message("<i>Індустріальна революція</i>: Будь-яке поповнення броні буде приносити максимальну кількість одиниць. \n\n<i>Розпад імперії</i>: Передайте по 1 району під порядкування Індії і Америки. Якщо таких країн немає в грі, по 1 району отримують гравці ліворуч і праворуч. Картка скидається у відбій.")
            ->send();
    }

    public function components(){
        $this->chat->message('Оберіть компоненти по яким треба опис:')
            ->keyboard(Keyboard::make()->buttons([
                Button::make('🎯 Стратегічні точки')->action('strategic')->width(0.5),
                Button::make('🏕 Природні об\'єкти')->action('nature')->width(0.5),
                Button::make('🏰 Об\'єкти без прив\'язки')->action('unlinked')->width(0.5),
            ]))->send();
    }
    public function strategic(){
        $this->chat->message('Оберіть який тип стратегічної точки вас цікавить:')
            ->keyboard(Keyboard::make()->buttons([
                Button::make('Ящики')->action('boxes')->width(0.5),
                Button::make('Бункери')->action('bunkers')->width(0.5),
                Button::make('Польові штаби')->action('headquarters')->width(1),
                Button::make('Аеродром')->action('airfields')->width(0.5),
                Button::make('Артилерійський центр')->action('artillery')->width(0.5),
            ]))->send();
    }
    public function boxes(){
        $this->chat->message("<i>Ящики</i> належать до <b>стратегічних точок</b>. На карті кампанії може бути до 8-10 ящиків. У разі відкриття коробка залишається відкритою, доки не відкриються всі інші. Після використання картку з відповідної колоди перемішують з іншими та повертають назад. \n\nЯщики можуть містити картки з різною кількістю запасів здоров’я, броні або боєприпасів. Також є порожні.")
            ->send();
    }
    public function bunkers(){
        $this->chat->message("<i>Бункери</i> належать до <b>стратегічних точок</b>. На карті може бути до 4 бункерів. Після використання, картку з відповідної колоди перемішують з іншими та повертають назад. Якщо вас атакують, коли ви перебуваєте в бункері, ви отримуєте зменшення шкоди на 3 од., але це не стосується гранати. Можливість захопити бункер з'явиться лише тоді, коли попередні загарбники відійдуть від нього на 3 гекса. Після захоплення цієї стратегічної точки під час наступних кількох ходів <b>ви повинні</b> відвести свого юніта на вказану вище відстань. \n\nБункери можуть містити карти з різною кількістю поповнення запасів здоров’я, броні чи патронів, а також негативні карти, які можуть завдати вам шкоди. Також є порожні. Але на відміну від ящиків, тут можна знайти додаткового юніта, який перейде під ваше командування. \n\n<b>Примітка</b>: Якщо ви знайдете додаткового юніта, він почне рух з будь-якого гексу поруч з бункером.")
            ->send();
    }
    public function headquarters(){
        $this->chat->message("<i>Польові штаби</i> належать до <b>стратегічних точок</b>. На карті може бути до 2 польових штабів. Після використання картку з відповідної колоди перемішують з іншими та повертають назад. Якщо вас атакують, коли ви перебуваєте в польовому штабі, ви отримуєте зменшення шкоди на 1 од., але це не стосується гранати. Можливість знову захопити польовий штаб з’явиться лише тоді, коли попередні загарбники відійдуть від нього на 6 гексів. Після захоплення цієї стратегічної точки під час наступних кількох ходів <b>ви повинні</b> відвести свого юніта на вказану вище відстань. \n\nПольові штаби можуть містити карти з різною кількістю поповнення запасів здоров’я, броні чи патронів, а також негативні карти, які можуть завдати вам шкоди. Також є порожні. Але на відміну від ящиків та бункерів, тут можна знайти спеціального юніта, який перейде під ваше командування. \n\n<b>Примітка</b>: Якщо ви знайдете спеціального юніта, він почне рух з вашої Бази.")
            ->send();
    }
    public function airfields(){
        $this->chat->message("<i>Аеродром</i> належить до <b>спеціальної стратегічної точки</b>. На карті може бути лише 1. Щоб відкрити його, вам потрібно буде «дослідити» секретну текстуру, позначену знаком питання, яка може бути розташована в будь-якому місці. Аеродром можна захопити, і про його відкриття стане відомо всім гравцям. Пілоту потрібно дістатися до нього, де він зможе застосувати свою здібність.")
            ->send();
    }
    public function artillery(){
        $this->chat->message("<i>Артилерійський центр</i> належить до <b>спеціальної стратегічної точки</b>. На карті може бути лише 1. Щоб відкрити його, вам потрібно буде «дослідити» секретну текстуру, позначену знаком питання, яка може знаходитися в будь-якому місці. Артилерійський центр можна захопити, і про його відкриття стане відомо всім гравцям. Командиру артилерії потрібно дістатися до нього, де він зможе застосувати свою здібність.")
            ->send();
    }
    public function nature(){
        $this->chat->message('Оберіть який тип природнього об\'єкту вас цікавить:')
            ->keyboard(Keyboard::make()->buttons([
                Button::make('🌲 Ліси')->action('forests'),
                Button::make('💧 Водойми')->action('waterBodies'),
                Button::make('⛰ Гори')->action('mountains'),
            ]))->send();
    }
    public function forests(){
        $this->chat->message("Ці типи локацій є <b>природними об’єктами</b>. Їх можна розташувати будь-де на карті. Якщо на вас напали, коли ви були в лісі, противник отримує зниження влучності на 2 од. (не поширюється на снайпера). Рухатись по ним можна тільки по 1 гексу. Потрібно рухатися обережно, щоб вас не помітили.")
            ->send();
    }
    public function waterBodies(){
        $this->chat->message("Ці типи локацій є <b>природними об’єктами</b>. Їх можна розташувати будь-де на карті. Якщо перетинати ці місця в морозну пору року (через замерзання води) втрат ходів не буде. Якщо ви перетинаєте їх в теплу пору року, то при спуску у воду і при підйомі на берег ви втрачаєте всі ходи, що залишилися. \n\n<b>Приклад</b>: Ви стоїте на відстані 1 гексу від води. Якщо на кубику випало 4, ви зробите 2 кроки (порожній гекс і гекс з водою) і зупинитесь до наступного ходу. Те саме, коли виходите на берег.\n\nЯкщо ви будете робити те ж саме, але в морозну пору, ви просто зробите свої 4 кроки з 4 викинутих на кубику.")
            ->send();
    }
    public function mountains(){
        $this->chat->message("Ці типи локацій є <b>природними об’єктами</b>. Їх можна розташувати будь-де на карті. Ви отримуєте збільшення дальності ураження на 1 од., якщо ви стоїте на них. Взимку не можна ходити в гори, тому що гори суворі місця. Якщо зима застає вашого юніта на горі, він негайно помирає. Якщо ви перетинаєте гірський хребет, ви втрачаєте всі кроки. Але якщо рухатися по гірському масиву вздовж, то втрати кроків при русі немає. \n\n<b>Приклад</b>: Ви стоїте за 1 гекс від гори. Якщо на кубику випало 4, ви зробите 2 кроки (порожній гекс і гекс з пагорбом) і зупинитесь до наступного ходу. Те саме, коли ви спускаєтесь.")
            ->send();
    }
    public function unlinked(){
        $this->chat->message('Оберіть який тип об\'єкту без прив\'язки вас цікавить:')
            ->keyboard(Keyboard::make()->buttons([
                Button::make('🏰 Бази')->action('bases'),
            ]))->send();
    }
    public function bases(){
        $this->chat->message("Цей тип текстури не відноситься ні до одного з попередніх. Це початкове розташування вашої фракції. Звідси всі ваші юніти починають рух. Базу неможливо захопити, вона не є ігровою зоною для інших гравців. Однак підрозділи, розташовані на цій території, можуть бути атаковані.")
            ->send();
    }

}
