{
    "board strategy": "Настольная стратегия",

    "Home": "Главная",
    "Rules": "Правила",
    "Units": "Юниты",
    "Components": "Компоненты",
    "Fractions": "Фракции",
    "Forum": "Форум",
    "Authorization": "Авторизация",
    "Log in": "Войти",
    "Logout": "Выйти",
    "You can visit forum only after registration": "Посетить форум можно только после регистрации",

    "Website is developed based on personal practice" : "Сайт разработан на основании личной практики",
    "Quick access" : "Быстрый доступ",
    "Ask author" : "Спросить автора",
    "Ask your question..." : "Задать вопрос",
    "Send" : "Отправить",

    "Play!" : "Играть!",
    "Really start the game?" : "Действительно начать игру",
    "Yeah, let's go!" : "Да, поехали!",
    "Nah, wait a minute" : "Нет, подождите минутку",

    "About the game" : "Про игру",
    "The game for" : "Игра для тех",
    "Those who love board games" : "Кто любит настольные игры",
    "Those who like tactic and strategy" : "Кому нравится тактика и стратегия",
    "Those for whom the word \"union\" is not just a sound" : "Для кого слово \"союз\" не просто звук",
    "Those who determine the game length themselves " : "Кто сам определяет длину партии",

    "enter your email": "введите вашу почту",
    "Remember me": "Запмонить меня",
    "Forgot password?": "Забыли пароль?",
    "Login": "Ваш логин",
    "Email": "Ваша почта",
    "Password": "Ваш пароль",
    "Repeat Password": "Повторите ваш пароль",
    "Registration": "Регестрация",
    "Your email will not use for spam": "Ваша почта не будет использована для спама",

    "Search" : "Поиск",
    "type something..." : "введите что-то...",
    "Categories" : "разделы",
    "Create post" : "Создать статью",
    "For Administrator" : "Администратору",
    "All posts" : "Ко всем статьям",
    "All categories" : "Ко всем категориям",
    "All users" : "Управление пользователями",
    "Create category" : "Создать категориюю",

    "Last themes" : "Последние статьи",

    "Posts management" : "Управление статьями",
    "Title" : "Название",
    "Administration" : "Управление",
    "Edit" : "Ред.",
    "Delete" : "Удалить",

    "Post creation" : "Создание статьи",
    "Post title" : "Название статьи",
    "Post content" : "Наполнение статьи",
    "Select a category:" : "Выберите категорию",
    "Attach" : "Прикрепить",
    "Edit post" : "Редактирование статьи",
    "Post update" : "Обновить статью",

    "Categories management" : "Управление категориями",
    "Category creation" : "Создание категории",
    "Category title" : "Название категории",
    "Category edit" : "Редактирование категории",
    "Update category" : "Обновление категории",

    "Users management" : "Управление пользователями",
    "Role" : "Роль",
    "Admin" : "Админ",
    "User" : "Юзер",
    "User update" : "Редактирование пользователей",
    "User login" : "Логин пользователя",
    "User name" : "Имя пользователя",

    "Posts from: " : "Статьи из категории:",

    "Found posts" : "Найденные статьи",

    "Introduction" : "Вступление",
    "The game invites you to plunge into a randomly developing alternative history of the World War, in which not only tactics and strategy will play a role, but also the generation of the campaign map itself. The events of the game will take place in randomly generated locations, where different countries of the world will enter the battle. Your tasks will include: destroy all enemies and/or achieve victory by any other means." : "Игра предлагает окунуться в случайно развивающуюся альтернативную историю Мировой войны, в которой будет играть роль не только тактика и стратегия, но и генерация самой карты кампании. События игры будут проходить в произвольно генерируемых локациях, на которых в битву вступят разные страны мира. В Ваши задачи будет входить: уничтожить всех врагов и/или достичь победы любыми другими способами.",
    "The game includes:" : "В набор входит:",
    "«Tasks» card deck" : "Колода карточек «Задания»",
    "«Daily events» card deck" : "Колода карточек «Ежедневные события»",
    "«Box» card deck" : "Колода карточек «Ящик»",
    "«Bunker» card deck" : "Колода карточек «Бункер»",
    "«Field headquarters» card deck" : "Колода карточек «Полевой штаб»",

    "«Units» card deck" : "Колода карточек «Юниты»",
    "212 unit tokens of seven types" : "212 фишек юнитов семи типов",
    "128 rank stars" : "128 ранговых звезд",
    "«Fraction» card deck" : "Колода карточек «Фракции»",
    "50-80 capture flags in eight different colors" : "50-80 флажков захвата восьми разных цветов",

    "160 hexes" : "160 гексов",
    "2 six-sided dice" : "2 шестигранных кубика",
    "8 or 10 «cleared» tokens" : "8 или 10 жетонов «зачищено»",
    "6,360 health, armor, ammo tokens" : "6 360 жетонов здоровья, брони, боеприпасов",
    "160 stands for unit chips in eight different colors" : "160 подставок под фишки юнитов восьми разных цветов",

    "How to start the game" : "Как начать игру",

    "The map is presented in the form of hexes, where in one large one (called a «district») there are seven small ones (this is ordinary «earth»). Now let's start the game.": "Карта представлена в форме гексов, где в одном большом (он называется «район») расположены семь маленьких (это обычная «земля»). Теперь приступаем к игре.",
    "Place hexes on the board in a random order, face down. Place decks of different types (tasks, daily events (hereinafter referred to as daily), box, bunker, field headquarters) next to the field. Now each player must choose or randomly draw a state (see below) to play for. Give everyone four basic units (see below), marked with an asterisk, which will be located at the initial «Base» location - a hex with a castle of one of eight colors. Flip the hexes on the board face up. Now you can examine the campaign map and figure out your next steps to capture it." : "Расположите на поле гексы в произвольном порядке рубашкой вверх. Разместите колоды разных типов (задания, ежедневные события (далее ёжик), ящик, бункер, полевой штаб) рядом с полем. Теперь каждый игрок должен выбрать или случайно вытянуть государство (см. ниже), за которое он будет играть. Раздайте каждому по четыре базовых юнита (см. ниже), помеченных звездочкой, которые будут располагаться на изначальной локации «База» – гекс с замком одного из восьми цветов. Переверните гексы на поле лицом вверх. Теперь можете осмотреть карту кампании и прикинуть ваши дальнейшие шаги по её захвату.",

    "How to play cards" : "Как играть картами",

    "The «Task» and «Daily» cards are picked up" : "Карточки «Задания» и «Ёжики» поднимаются",
    "first at the start of your turn" : "первыми в начале вашего хода",
    "before any other action is taken, and are spoken out (see note below). " : "перед тем как сделать любое другое действие, и озвучиваются (примеч. см. ниже)",

    "The first ones «cling» to the base unit and do not drop until it receives a rank or until you want to drop the task (see below). The second ones give a positive (hereinafter referred to as buff) or negative (hereinafter referred to as debuff) effect on all your soldiers at once and are postponed until the end. They are colored green (positive daily) and red (negative daily). Cards «Box», «Bunker», «Field Headquarters» are raised if you have captured the strategic point corresponding to it (see below)." : "Первые, «цепляются» на базового юнита и не скидываются, пока тот не получит звание или пока Вы не захотите скинуть задание (см. ниже). Вторые единожды дают положительный (далее баф) или отрицательный (далее дебаф) эффект на всех ваших солдат разом и откладываются в отбой. Они окрашены зеленым (положительные ежи) и красным цветами (отрицательные ежи). Карточки «Ящик», «Бункер», «Полевой штаб» поднимаются в том случае, если Вы захватили стратегическую точку, соответствующую ей (см. ниже).",

    "Note:" : "Примечание:",

    "Should to note that non-basic units, that is," : "Следует отметить, что неосновные подразделения, то есть,",
    "special units": "особые юниты",
    "and": "и",
    "additional units": "дополнительные юниты",
    "(see below)": "(см. ниже)",
    "can not": "не могут",
    "perform tasks. Also, tasks do not have to be completed or even taken from the deck during your unit's turn.": "выполнять задание. Кроме того, задание не нужно выполнять или даже брать из колоды во время хода вашего подразденеия.",

    "Each" : "Каждый",
    "basic unit" : "базовий юнит",
    "can reset one task once without losing points (see below)." : "имеет возможность сбросить один раз одно задание без потери очков (см. ниже).",

    "It happens that some conditions in the cards will strongly conflict with the rules. Therefore, remember: the rules are certainly important to follow, but the text on the Daily cards is more important than them in meaning, and the text on the Task cards is more important than the previous ones." : "Бывает такое, что некоторые условия в карточках будут сильно конфликтовать с правилами. Потому запомните: правила безусловно важны для соблюдения, но текст на карточках «Ежей» важнее их по значению, а текст на карточках «Задания» важнее предыдущих.",

    "Start and end of the game" : "Начало и завершение игры",

    "It is advisable to decide how long your game will last, otherwise it may last overnight. Next, decide who goes first by rolling the dice, playing rock-paper-scissors, arguing and shouting, or other methods that suit you." : "Желательно определиться, сколько по времени будет длиться Ваша игра, иначе это может затянуться и на ночь. Далее решите, кто ходит первым с помощью броска кубика, игры «Камень-ножницы-бумага», спорами и криками или другими удобными Вам методами.",

    "There are different ways to win:" : "Победить можно разными способами:",

    "Destroy all enemies" : "Уничтожить всех противников",
    "Win at the end of the game with the maximum number of points (see below)" : "Выиграть в конце игры по максимальному набранному числу очков (см. ниже)",

    "The player who has lost all units is eliminated from the game." : "Игрок, который потерял всех юнитов выбывает из игры.",


    "Game phases" : "Игровые фазы",

    "The game consists of phases. Each phase ends with the person who starting the game. One phase equal the one year. Each player, in order of his turn, takes the following actions:" : "Игра состоит из фаз. Каждая фаза заканчивается тем, кто начинал игру. Одна фаза равна одному году. Каждый игрок в порядке своего хода совершает следующие действия:",

    "Find out what awaits you today" : "Узнай, что сегодня ожидает тебя",
    "draw one card from the «Daily events» card deck for every unit before it starts movement and announce it. For all units, fulfill the conditions that are written on the card. After completion, discard the card." : "вытяните по одной карте из колоды «Ежики» для каждого юнита перед тем, как он начнет движение, и объявите их. Для всех юнитов выполните условия, написанные на карте. По завершении сбросьте карту.",

    "In search of glory" : "В поисках славы",
    "if desired, draw one card from the «Tasks» card deck and announce it. Keep the card with your unit until him will promoted or if you decide to discard the card. Once the conditions are met, discard the card." : "по желанию вытащите одну карту из колоды «Задания» и объявите ее. Удерживайте карту у своего юнита до момента его повышения, или если вы не решите сбросить карту. Когда условия выполнены, сбросьте карту.",
    "There can be no more than" : "Не может быть больше",
    "one" : "одной",
    "«Tasks» card" : "карточки «Задания»",
    "on one basic unit" : "на одном базовом юните",
    "You can not to take the «Tasks» card for non-basic units." : "Ты не можешь взять карточку «Задания» для небазового юнита.",

    "Is it worth" : "А стоит ли",
    "if there are enough hexes between your and an enemy unit, you can optionally start a battle with it (see below). If you want to avoid combat, you can simply do the number of steps that rolled on the die." : "если между вашим и враждебным юнитом достаточно гексов, вы можете по желанию начать с ним бой (см. ниже). Если вы хотите избежать боя, вы можете просто сделать то количество шагов, которое выпало на кубике.",

    "Repeat all steps for all your units." : "Повторите все действия для всех ваших юнитов.",
    "You can use only" : "Вы можете использовать только",
    "one die" : "один кубик",
    "for movement." : "для перемещения.",
    "Each unit can move only once at its turn." : "Каждый юнит может ходить только один раз за свой ход.",

    "In one turn you can shoot and move." : "В один ход вы можете стрелять и двигаться.",
    "But there can not be more" : "Но на одном гексе не может быть больше",
    "than one" : "одного",
    "unit on the hex." : "юнита.",


    "Fighting system" : "Боевая система",

    "It is important to know that each unit has its own rules of engagement (see below). It should be remembered that you can only shoot at an enemy if he is standing on the same line with your one. After you will deal the damage to the enemy, the «armor» parameter will decrease first. When the «armor» parametr will reach zero, the «health» parameter will decrease next. You are obliged to strictly follow these instructions, and also not to forget possible buffs or debuffs that could be written on certain cards before you start the battle." : "Важно знать, что каждый юнит имеет свои правила боя (см. ниже). Следует помнить, что стрелять по врагу можно только в том случае, если он стоит на одной линии с вашим юнитом. После того, как вы нанесете врагу урон, сначала уменьшится параметр «броня». Когда параметр «броня» достигнет нуля, дальше будет уменьшаться параметр «здоровье». Вы обязаны строго следовать этим инструкциям, а также не забывать о возможных бафах или дебафах, которые могут быть записаны на определенных картах перед началом боя.",

    "Before you shoot, make sure that there is a sufficient number of hexes between your and the enemy unit (it is different for each type of unit);" : "Прежде чем стрелять, убедитесь, что между вашим и враждебным юнитом есть достаточное количество гексов (оно разная для каждого типа юнита);",

    "You can engage in close combat if both units (yours and enemy one) are on adjacent hexes from each other;" : "Вы можете вступить в ближний бой, если оба юнита (ваш и враждебный) находятся на соседних гексах друг от друга;",

    "Before knife stabbing or shooting, you must roll one or two dice respectively, which will show the amount of damage and accuracy;" : "Перед ударом ножа или выстрелом необходимо бросить один или два кубика соответственно, которые покажут количество повреждений и точность;",

    "An accuracy die is rolled when the difference between the units" : "Кубик точности бросается, когда разница между юнитами",
    "is greater," : "больше,",
    "than 4 hexes inclusive;" : "чем 4 гекса включительно;",

    "In knife stabbing, accuracy dice is not rolled." : "В бою на ножах кубик на не бросается.",

    "In the battle damage will deal as much as the amount of damage rolled on the dice. In the case of a die roll for accuracy, damage is subtracted with the difference;" : "В бою будет нанесено столько урона, сколько выпало на кубике. В случае броска кубика на точность повреждения высчитается с разницей;",

    "If on the damage die rolls 5 and on the accuracy die rolls 6, then the damage will dealt in full." : "Если на кубике урона выпадет 5, а на кубике точности - 6, то урон будет нанесен в полном объеме.",
    "If on the damage die rolls 5 and on the accuracy die rolls 4, then the difference that is missing to the maximum value of the second die is subtracted. That is: 5 damage minus 2 accuracy, we get 3 units of damage." : "Если на кубике урона выпало 5, а на кубике точности – 4, то вычитается разница, которой не хватает до максимального значения второго кубика. То есть: 5 урона минус 2 точности, получаем 3 единицы урона.",

    "In knife stabbing, both players roll the damage dice. Who roll the highest number wins. The losing unit dies. If the dice values is equal, the battle ends;" : "В битве на ножах оба игрока бросают кубики. Побеждает тот, у кого выпадет наибольшее число. Проигравший юнит погибает. Если значение кубиков равно, бой заканчивается;",

    "The grenade (see below) is thrown only three hexes and can deal full damage;" : "Граната (см. ниже) бросается только на три гекса и может нанести полный ущерб;",

    "Strategic points such as the «Bunker» and «Field Headquarters» have a buff that allows you to receive an armor bonus in the event of a firefight there. That is, the enemy's damage will be reduced (see below);" : "Такие стратегические точки, как «Бункер» и «Полевой штаб» имеют баф, который позволяет получить бонус к броне в случае перестрелки там. То есть урон противника будет уменьшен (см. ниже);",

    "Natural objects have buffs or debuffs that gives different effects to the unit which standing or passing through them (see below)." : "Природные объекты имеют бафы или дебафы, которые дают разные эффекты юниту, который стоит или проходит через них (см. ниже).",

    "It is impossible" : "Невозможно",
    "to make a shot, to throw a grenade, or to melee with knife in one turn. You need to choose one thing. Whenever damage is dealt, the «armor» parameter is always decrease first, and only then the «health» parameter." : "за один ход сделать выстрел, бросить гранату или сражаться ножом. Нужно выбрать что-нибудь одно. Каждый раз, когда нанесен урон, сначала уменьшается параметр «брони», а только затем параметр «здоровья».",


    "There are several types of units in the game, which are divided into different types of forces, and also have their own special capabilities. There are seven of them in total: rifleman, stormtrooper, scout, sniper, machine gunner, pilot and artillery commander." : "В игре есть несколько видов юнитов, которые делятся на разные типы войск, а также имеют свои особые возможности. Всего их семь: стрелок, штурмовик, скаут, снайпер, пулеметчик, пилот и командир артиллерии.",

    "The basic units are the first 4 units that are given to you at the start of the game (rifleman, scout, machine gunner, sniper). They are marked with a star. It is worth noting that if you received a unit during the promoted, that is, you called it onto the field, then it is not basic and is indicated by a number for simplified orientation." : "Базовые юниты – это первые 4 юнита, которые даются вам в начале игры (стрелок, скаут, пулеметчик, снайпер). Они отмечены звездочкой. Следует отметить, что если вы получили юнит во время повышения, то есть вызвали его на поле, то он не является базовым и обозначается номером для упрощенной ориентировки.",
    "In order not to describe here what is already on the site, we suggest simply following the link by clicking on the circle. Yes, yes, right on the icon, or on the inscription with its name." : "Чтобы не описывать здесь то, что уже есть на сайте, предлагаем просто перейти по ссылке, нажав круг. Да-да, прямо на иконку или на надпись с ее названием.",

    "Texture objects, strategic points and their hidden bonuses" : "Текстурные объекты, стратегические точки и их скрытые бонусы",
    "The map shows several textures that have different buffs and debuffs. Conventionally, they can be divided into: «Strategic» and «Natural». In order to take advantage of the effects of the former, you must «capture» them, that is, place your unit on a hex with this object. In each such object, except of the airfield and the artillery center, cards with buffs or debuffs are hidden. To get the effects from the second, you just need to stand on them." : "На карте показано несколько текстур, имеющих разные бафы и дебафы. Условно их можно разделить на: «Стратегические» и «Природные». Чтобы воспользоваться эффектами первых, вы должны «захватить» их, то есть разместить своего юнита на гексе с этим объектом. В каждом таком объекте, кроме аэродрома и артиллерийского центра, спрятаны карты с бафами или дебафами. Чтобы получить эффект от второго, вам просто нужно встать на них.",


    "Fractions and their features" : "Фракции и их особенности",
    "The game has a number of countries for which the player can play. At the start of the game, they are given out randomly or chosen at will, but we still recommend the first option. Each fraction has two features that are always active. Study them carefully and apply them wisely." : "В игре есть ряд стран, за которые игрок может играть. В начале игры они выдаются случайным образом или выбираются по желанию, но мы все равно рекомендуем первый вариант. Каждая фракция имеет две особенности, которые всегда активны. Внимательно изучите их и применяйте с умом.",
    "You may think that the features of some fractions may violate the rules. Just know that their features completely ignore all the rules and other cards, being undeniable." : "Вы можете подумать, что особенности некоторых фракций могут нарушать правила. Просто знайте, что их особенности полностью игнорируют все правила и другие карты, будучи неоспоримыми.",


    "What are points and what about them?" : "Что такое баллы и что с ними делать?",

    "Should to recal about the points that were mentioned earlier. As stated, you can win the game if at the end you have more points than your opponents. They can be obtained in different ways. But you can also lose them. It is very important to keep track of their number and, if desired, write them down on time to facilitate calculations and fair play." : "Следует напомнить о баллах, упомянутых ранее. Как было сказано, вы можете выиграть игру, если в конце у вас будет больше баллов, чем у ваших соперников. Их можно получить разными способами. Но вы также можете их потерять. Очень важно следить за их количеством и при желании своевременно записывать для облегчения расчетов и честной игры.",

    "What you can get points for:" : "За что можно получить баллы:",
    "The easiest and fastest way to score points is to capture enemy or neutral territories. For each captured district, you get 1 point." : "Самый простой и быстрый способ набрать очки – это захват враждебных или нейтральных территорий. За каждую захваченную район вы получаете 1 балл.",
    "It will be a little more expensive to capture districts with a strategic point. For such areas you get 2 points." : "Несколько дороже обойдется захват районов со стратегической точкой. За такие участки вы получаете 2 балла.",
    "To capture the «district» immediately, you need to place a flag of your color on the central hex." : "Чтобы немедленно захватить район, нужно разместить флаг своего цвета на центральном гексе.",
    "The next simple method is to mark the completion of tasks. For each completed task, you receive 1 point. In the same place where it is written about a double reward, you get 2 points accordingly." : "Следующий простой способ – это отметка о выполнении задач. За каждое выполненное задание вы получаете 1 балл. Там же, где написано о двойном вознаграждении, вы получаете соответственно 2 балла.",
    "And the last possible option would be to kill an enemy units. For one killed, you will get 1 point." : "И последним возможным вариантом будет убийство юнитов противника. За одного убитого вы получите 1 балл.",

    "What you can lose points for:" : "За что можно потерять баллы:",
    "If your district was captured, you lose 1 point." : "Если ваш район был захвачен, вы теряете 1 балл.",
    "If you reset tasks, you lose 5 points. But remember that 1 task can be reset without losing points." : "Если вы сбросите задачу, вы теряете 5 баллов. Но помните, что одну задачу можно сбросить без потери баллов.",
    "For an uncompleted task you lose 1 point." : "За невыполненное задание вы теряете 1 балл.",
    "If you lose all your units and you eliminated from the game, your points are canceled." : "Если вы лишаетесь всех своих юнитов и выбываете из игры, ваши баллы аннулируются.",

    "Rank system and tasks" : "Система званий и задания",
    "Tasks play an important role in the game, and there are those who can ignore the rules of the game and the «Dayli» cards. Of course, you may do not do them - it depends on your desire and desire to win. For completing each task, one point is added to your task scale. What it is?" : "Задания играют важную роль в игре, и есть те, которые могут игнорировать правила игры и карты «Ежиков». Конечно, вы можете их не делать – это зависит от вашего желания и желания победить. При выполнении каждого задания к вашей шкале задач добавляется один балл. Что это?",
    "This task scale directly affects the promoting system for your basic units. Every three completed tasks allow you to receive a new soldier rank. These ranks provide the opportunity to apply the effect that accompanies upon receipt. The completed task must be placed under the unit’s card, a kind of note indicating that he completed them. After you done three tasks , you must return them in the «Tasks» deck and shuffle them." : "Эта шкала задач оказывает непосредственное влияние на систему продвижения ваших базовых юнитов. Каждые три выполненных задания позволяют получить новое звание солдата. Эти звания позволяют применить эффект, который появляется при получении. Выполненное задание должно быть размещенно под карточкой юнита, своего рода памятник о том, что он их выполнил. После выполнения трех заданий необходимо вернуть их в колоду «Задания» и перетасовать.",
    "Initially, each basic unit is a Private. During the game, all your units," : "В начале каждый базовый юнит является рядовым. Во время игры все ваши юниты,",
    "except" : "кроме",
    "extra and summoning ones, can be promoted to four ranks:" : "дополнительних и призванных могут быть повышены на четыре звания:",
    "Sergeant" : "Сержант",
    "Captain" : "Капитан",
    "Colonel" : "Полковник",
    "General" : "Генерал",
    "After completing the task, you need to record that this unit completed the mission. As soon as three tasks have been completed, a star is placed on your unit’s card, which indicates the rank (Sergeant - 1, Captain - 2, Colonel - 3, General - 4)." : "После выполнения задания, вам нужно зафиксировать, что этот юнит выполнил миссию. После выполнения трех заданий на карточке вашего юнита появляется звездочка, указывающая на звание (сержант – 1, капитан – 2, полковник – 3, генерал – 4).",

    "What is the advantage of ranks?" : "Какой плюс от звания?",
    "Upon reaching this rank, your unit's armor is completely restored. Also, you have the opportunity to summon one rifleman to the front." : "После достижения этого звания броня вашего юнита полностью восстанавливается. Также у вас есть возможность призвать одного стрелка на фронт.",
    "Upon reaching this rank, your unit's health is fully restored. Also, you have the opportunity to summon one stormtrooper to the front." : "После достижения этого звания здоровье вашего юнита полностью восстанавливается. Также у вас есть возможность призвать одного штурмовика на фронт.",
    "Upon reaching this rank, your unit's health and armor are fully restored. Also, you have the opportunity to summon one scout to the front." : "После достижения этого звания здоровье и броня вашего юнита полностью восстанавливаются. Также у вас есть возможность призвать одного скаута на фронт.",
    "Upon reaching this rank, you have the opportunity to call a sniper or machine gunner to the front, as well as call for an air strike on enemy troops." : "После достижения этого звания, вы можете призвать на фронт снайпера или пулеметчика, а также вызвать авиаудар по войскам противника.",
    "It is important to remember that only basic units can receive ranks and draw the «Tasks» deck. Summoned and extra units do not have this ability." : "Важно помнить, что только базовые юниты могут получать звание и тянуть колоду «Задания». Призванные и дополнительные юниты не имеют этой возможности.",


    "Other game features" : "Другие особенности игры",

    "Let's quickly return to what we've covered. Rules are an undeniable part of the game. But higher in importance are: «Dailys», «Tasks» and fractions effects. Follow this carefully, and you will not have problems with the game." : "Давайте быстро вернемся к тому, что мы рассмотрели. Правила являются неоспоримой частью игры. Но выше по важности являются: «Ежики», «Задания» и эффекты фракций. Внимательно за этим следите и у вас не возникнет проблем с игрой.",
    "As for the time of year? There are only two of them: winter (cold) and summer (warm). Each of them lasts two phases, but the game always starts at summer. They do not carry any more gaming load other than what has already been written." : "Что касается времен года? Их всего два: зимний (холодный) и летний (теплый). Каждое из них длится две фазы, но игра всегда начинается летом. Больше игровой нагрузки кроме того, что уже было написано, они не несут.",
    "In conclusion, we would like to say that the game is full of setups and all kinds of triks. Remember that every country does not have an endless number of troops that it leads. The combat units may run out, so keep a close eye on it." : "В заключение хочется сказать, что игра полна подстав и всевозможных уловок. Помните, что у каждой страны нет бесконечного количества войск, которыми она управляет. Боевой состав может заканчиваться, поэтому внимательно следите за ним.",
    "For a more comfortable game, treat it with humor. By the way, you are not prohibited from organizing «unions». But to betray, to stick a knife in the back or put a spoke in the wheels is always welcome. Alliances are concluded in words, but for greater realism, we recommend using a separate piece of paper so that this is clearly recorded and no one asks unnecessary questions. One has only to add that the conditions of such unions must be negotiated or spelled out and observed. There are no clear rules about this point." : "Для более комфортной игры относитесь к ней с юмором. Кстати, вам не запрещено организовывать «союзы». Но предать, воткнуть нож в спину или вставить палку в колеса всегда приветствуется. Союзы заключаются на словах, но для большей реалистичности рекомендуем использовать отдельный лист бумаги, чтобы это было четко зафиксировано и никто не задавал лишних вопросов. Остается лишь добавить, что условия таких союзов должны быть оговорены или прописаны и соблюдены. На этот счет нет четких правил.",
    "You are the ruler, your country is your kid. Everyone who encroaches on your territory is an enemy, and these are the other players at the table. Don't trust anyone. Lead wisely and honestly. Correctly assess your chances and achieve victories." : "Вы правитель, ваша страна – ваш ребенок. Каждый, кто покушается на вашу территорию – враг, а это другие игроки за столом. Не доверяйте никому. Правьте мудро и честно. Правильно оценивайте свои шансы и добивайтесь побед.",
    "Well, have a good game!" : "Что ж, удачной игры!",


    "Previous" : "Пред.",
    "Next" : "След.",



    "Unit's indicators and their classification" : "Показатели юнитов и их классификация",
    "Standard units of the «infantry» type" : "Стандартные юниты типа «пехота»",
    "The rifleman" : "Стрелок",
    "only owns a rifle and a knife. Has 10 points of health and armor. The ammunition is designed for 10 shots, it fires once. The maximum firing range is 8 hexes." : "владеет только винтовкой и ножом. Имеет 10 ед. здоровья и брони. Боезапас рассчитан на 10 выстрелов, стреляет единично. Дальность максимальной стрельбы 8 гексов.",

    "The stormtrooper" : "Штурмовик",
    "wields a rifle, a knife and a grenade. Has 10 points of health and armor. The ammunition is designed for 10 shots and 1 grenade throw, it fires once. The maximum firing range is 8 hexes, the maximum grenade throw range is 3 hexes. A unit cannot throw a grenade and shoot in one turn; you need to choose one thing." : "владеет винтовкой, ножом и гранатой. Имеет 10 ед. здоровья и брони. Боезапас рассчитан на 10 выстрелов и на 1 бросок гранаты, стреляет единично. Дальность максимальной стрельбы 8 гексов, дальность максимального броска гранаты 3 гекса. Юнит не может в один ход кинуть гранату и выстрелить, нужно выбрать что-то одно.",
    "The grenade can deal area damage. It will deal" : "Граната может наносить урон по площади. Она нанесет",
    "the full amount of damage" : "полное количество урона,",
    "if it was thrown at one unit." : "если была использована против одного юнита.",
    "However, if it was used against several units, then those adjacent to the main enemy unit" : "Если же, она была использована против нескольких юнитов, то соседние от основного вражеского юнита",
    "will receive half the damage" : "получат половину от урона,",
    "that received first." : "который  получил первый.",
    "Example:" : "Пример:",
    "If you throw a grenade at three units (at the central one), and the die rolls 5, then the central one gets all 5 damage points, and those adjacent to it will get 3 damage points (cuz of rounded up)." : "Если Вы кинули гранату в трех юнитов (целясь в центрального) и на кубике выпало 5, то центральный получает все 5 ед. урона, а соседние с ним 3 ед. урона (из-за округления в большую сторону).",

    "The scout" : "Скаут",
    "wields an auto-rifle and a knife. Has 10 points of health and armor. The ammunition is designed for 10 burst shots, using 1 shot each. The maximum firing range is 5 hexes. Has the ability to distribute damage across units if they are in the affected area." : "владеет автоматом и ножом. Имеет 10 ед. здоровья и брони. Боекомплект рассчитан на 10 выстрелов очередями по 1 выстрелу. Максимальная дальность стрельбы составляет 5 гексов. Обладает способностью распределять урон между юнитами, если они находятся в зоне поражения.",
    "You are fighting against a group of three enemy units. When you roll the die, you get 5. Now you have the opportunity to distribute this damage across all enemies, if they are close to each other. For example, to the first - 2 damage points, to the second - 2 damage points, to the third - 1 damage points. At the same time, you need to remember that they must be on hexes adjacent to the main enemy target, and this target itself must be on the same line with your unit." : "Вы сражаетесь против группы из трех вражеских юнитов. Когда вы бросаете кубик, вам выпадает 5. Теперь у вас есть возможность распределить этот урон между всеми врагами, если они находятся рядом друг с другом. Например, первому – 2 ед. урона, второму – 2 ед. урона, третьему – 1 ед. урона. При этом следует помнить, что они должны находиться на гексах, прилегающих к основной цели, а сама эта цель должна находиться на одной линии с вашим юнитом.",


    "Special units of the «infantry» type" : "Специальные юниты типа «пехота»",

    "The sniper" : "Снайпер",
    "belongs to the" : "относится к",
    "special units." : "специальным юнитам.",
    "Wields a sniper rifle and a knife. Has 10 points of health and armor. The ammunition is designed for 10 shots, fired once. Maximum firing range is 12 hexes. Has the ability to hit an opponent without rolling an accuracy die." : "Владеет снайперской винтовкой и ножом. Имеет 10 ед. здоровья и брони. Боекомплект рассчитан на 10 выстрелов, стрелят единично. Максимальная дальность стрельбы 12 гексов. Имеет способность поразить противника, не бросая кубик на точность.",

    "The machine gunner" : "Пулемётчик",
    "He wields a machine gun and a knife. Has 10 points of health and armor. The ammunition is designed for 10 burst shots, using 1 shot each. The maximum firing range is 6 hexes. Has the ability to deal double damage to one enemy or deal normal damage to several enemies." : "Владеет пулеметом и ножом. Имеет 10 ед. здоровья и брони. Боезапас рассчитан на 10 выстрелов очередями, используя 1 ед. боезапаса. Максимальная дальность стрельбы 6 гексов. Имеет способность наносить двойной урон одному врагу или наносить обычный урон нескольким врагам.",
    "You are fighting against a group of 3 enemy units. When you roll the die, you get 6. Now you have a choice: duplicate the number and deal 12 damage points to any unit, or deal the usual 6 damage points to all three. At the same time, you need to remember that they must be on hexes adjacent to the main enemy target, and this target itself must be on the same line as your unit." : "Вы сражаетесь против группы из трех вражеских юнитов. Когда вы бросаете кубик, вам выпадает 6. Теперь у вас есть выбор: продублировать число и нанести 12 ед. урона любому юниту или нанести обычные 6 ед. урона всем троим. При этом нужно помнить, что они должны находиться на соседних гексах с основной целью, а сама эта цель должна находиться на одной линии с вашим юнитом.",

    "Extra units of the «infantry» type" : "Дополнительные юниты типа «пехота»",

    "The pilot" : "Пилот",
    "extra units." : "дополнительным юнитам.",
    "He wields a pistol and a knife. Has 10 health points. The ammunition is designed for 1 shot, it fires once. The maximum firing range is 5 hexes. Has the ability to call an airstrike from the airfield (see below) to any point on the campaign map. The airstrike is carried out on 1 or more hexes in a row, depending on the number on rolled die. Deals 4 damage points to those hexes that were selected. After using his ability, the pilot disappears from the campaign map." : "Он владеет пистолетом и ножом. Имеет 10 ед. здоровья. Боезапас рассчитан на 1 выстрел, стреляет единично. Дальность максимальной стрельбы 5 гексов. Имеет способность призвать с аэродрома (см. ниже) авиаудар в любую точку на карте кампании. Авиаудар наносится на 1 или более гексов в ряд, в зависимости от числа, выпавшего после броска кубика. Наносит 4 ед. урона по тем гексам, которые были выбраны. После использования своей особенности пилот пропадает с карты кампании.",

    "The artillery commander" : "Командир артилерии",
    "He wields a pistol and a knife. Has 10 health points. The ammunition is designed for 1 shot, it fires once. The maximum firing range is 5 hexes. Has the ability to call an artillery strike from the artillery center (see below) to any point on the campaign map. An artillery strike inflicts 6 damage points on a hex of your choice and 4 damage points on hexes in contact with it." : "Он владеет пистолетом и ножом. Имеет 10 очков здоровья. Боекомплект рассчитан на 1 выстрел, выстреливается один раз. Максимальная дальность стрельбы — 5 гексов. Имеет возможность вызвать артиллерийский удар из артцентра (см. ниже) в любую точку на карте кампании. Артиллерийский удар наносит 6 ед. урона выбранному вами гексу и 4 ед. урона гексам, соприкасающимся с ним.",



    "Game components" : "Игровые компоненты",

    "Strategic points" : "Стратегические точки",

    "Boxes" : "Ящики",
    "belong to" : "относятся к",
    "strategic points" : "стратегическим точкам",
    "There can be up to 8-10 boxes on the campaign map. If opened, the box remains open until all the remaining ones are opened. After use, a card from the corresponding deck is shuffled with the others and put back." : "На карте кампании может быть до 8-10 ящиков. Если открыть коробку, она остается открытой до тех пор, пока не будут открыты все оставшиеся. После использования карта из соответствующей колоды перемешивается с остальными и кладется обратно.",
    "Boxes may contain cards with varying amounts of health, armor, or ammo replenishment. Also there are empty ones." : "В ящиках могут находиться карты с разным количеством здоровья, брони или боеприпасов. Также есть пустые.",

    "Bunkers" : "Бункеры",
    "There can be up to 4 bunkers on the map. After use, a card from the corresponding deck is shuffled with the others and put back. If you are attacked while you are in the bunker, you receive a damage reduction of 3 points, but this does not apply to the grenade. The opportunity to recapture the bunker will only appear when the previous invaders move away from it on 3 hexes." : "На карте может быть до 4 бункеров. После использования карта из соответствующей колоды перемешивается с остальными и кладется обратно. Если на вас напали, пока вы находитесь в бункере, вы получаете снижение урона на 3 ед., но на гранату это не распространяется. Возможность отбить бункер появится только тогда, когда предыдущие захватчики отойдут от него на 3 гекса.",
    "After capturing this strategic point, during the next 3 turns," : "После захвата этой стратегической точки в течение следующих 3 ходов",
    "you must to" : "вы должны",
    "withdraw your unit to the distance specified above." : "отвести своего юнита на указанное выше расстояние.",
    "Bunkers may contain cards with varying amounts of health, armor, or ammo refills and negative cards that can deals damage to you. Also there are empty ones. But unlike the boxes, an extra unit can be found here, which will come under your command." : "Бункеры могут содержать карты с разным количеством здоровья, брони или пополнения боеприпасов, а также отрицательные карты, которые могут нанести вам урон. Также есть пустые. Но в отличие от ящиков здесь можно найти дополнительного юнита, который перейдет под ваше командование.",
    "If you find an extra unit, it starts moving from any hex next to the bunker." : "Если вы обнаружите дополнительного юнита, он начнет двигаться из любого гекса рядом с бункером.",

    "Field headquarters" : "Полевые штабы",
    "There can be up to 2 field headquarters on the map. After use, a card from the corresponding deck is shuffled with the others and put back. If you are attacked while you are in the Field headquarters, you receive a damage reduction of 1 points, but this does not apply to the grenade The opportunity to capture the field headquarters again will appear only when the previous invaders move away from it on 6 hexes.": "На карте может быть до 2 полевых штабов. После использования карта из соответствующей колоды перемешивается с остальными и кладется обратно. Если на вас напали, пока вы находитесь в Полевом штабе, вы получаете снижение урона на 1 ед., но это не касается гранаты. Возможность снова захватить полевой штаб появится только тогда, когда предыдущие захватчики отойдут от него на 6 гексов.",
    "Field headquarters may contain cards with varying amounts of health, armor, or ammo refills and negative cards that can deals damage to you. Also there are empty ones. But unlike the boxes and bunkers, a special unit can be found here, which will come under your command.": "Полевой штаб может содержать карты с разным количеством здоровья, брони или пополнения боеприпасов, а также отрицательные карты, которые могут нанести вам урон. Также есть пустые. Но в отличие от ящиков и бункеров здесь можно найти специального юнита, который перейдет под ваше командование.",
    "If you find a special unit, it starts moving from your Base.": "Если вы обнаружите специального юнита, он начнет двигаться с вашей Базы.",

    "Airfield" : "Аэродром",
    "is belong to" : "относится к",
    "special strategic points" : "специальным стратегическим точкам",
    "There can only be 1 on the map. In order to open it, you will need to «investigate» a secret texture marked with a question mark, which can be located in any given location. The airfield can be captured and its opening will become known to all players. The pilot needs to get to it, where he can use his ability." : "На карте может быть только 1. Для того, чтобы открыть его, вам нужно будет «исследовать» секретную текстуру, отмеченную знаком вопроса, которая может находиться в любой заданной локации. Аэродром можно захватить и его открытие станет известно всем игрокам. Пилоту необходимо добраться до него, где он сможет применить свои способности.",

    "Artillery center" : "Артиллерийский центр",
    "There can only be 1 on the map. In order to open it, you will need to «investigate» a secret texture marked with a question mark, which can be located in any given location. The artillery center can be captured and its opening will become known to all players. The artillery commander needs to get to it, where he can use his ability." : "На карте может быть только 1. Для того, чтобы открыть его, вам нужно будет «исследовать» секретную текстуру, отмеченную знаком вопроса, которая может находиться в любой заданной локации. Аэродром можно захватить и его открытие станет известно всем игрокам. Командиру артиллерии необходимо добраться до него, где он сможет применить свои способности.",

    "Natural objects" : "Природные объекты",

    "Trees" : "Деревья",
    "These types of locations are" : "Подобного рода локации являются",
    "natural objects" : "природными объектами",
    "They can be located anywhere on the map. If you were attacked while you were in the forests, the enemy receives a reduction in accuracy by 2 points (does not apply to the sniper). Moving along them is a maximum of 1 hex. Need to move carefully so you should not be noticed you know." : "Они могут находиться в любом месте карты. Если на вас напали, пока вы находились в лесу, противник получает снижение точности на 2 ед. (не распространяется на снайпера). Перемещение по ним происходит максимум на 1 гекс. Нужно двигаться осторожно, чтобы вас не заметили.",

    "Water heks" : "Водные гексы",
    "They can be located anywhere on the map. If you cross these places in the frosty hour (cuz the water freezing) there is no loss of moves. If you cross them in warm weather, then when descending into the water and when ascending to the shore, you lose all the remaining moves." : "Они могут находиться в любом месте карты. Если пересечь эти места в морозный час (поскольку вода замерзает) потери хода не будет. Если пересечь их в теплую погоду, то при спуске в воду и при подъеме на берег вы потеряете все оставшиеся ходы.",
    "You are standing 1 hex away from the water. If 4 is rolled on the die, you will take 2 steps (an empty hex and a hex with water) and stop walking until the next turn. The same is when you go ashore." : "Вы стоите в 1 гексе от воды. Если на кубике выпало 4, вы сделаете 2 шага (пустой гекс и гекс с водой) и остановитесь до следующего хода. То же самое происходит, когда вы выходите на берег.",
    "If you will do the same thing but in frosty time, you just do your 4 steps from 4 rolled on the die." : "Если вы будете делать то же самое, но в морозное время, вы просто сделаете свои 4 шага из 4, выпавших на кубике.",

    "Mountains or hills" : "Горы или холмы",
    "They can be located anywhere on the map. You get an increase in firing range by 1 unit if you stand on them. In winter, it is not possible to walk in the mountains, because mountains are harsh places. If winter finds your unit on the mountain, it immediately dies. In case when you crossing a mountain ridge, you lose all remaining steps (see below). But if you move along a mountain range, then there is no loss of steps while moving." : "Они могут находиться в любом месте карты. Вы получаете увеличение дальности стрельбы на 1 ед., если встанете на них. Зимой по горам ходить невозможно, потому что горы – суровые места. Если зима застанет вашего юнита на горе, он тут же погибает. Если вы пересекаете горный хребет, вы теряете все оставшиеся шаги (см. ниже). Но если двигаться по горному массиву, то потери шагов при движении не происходит.",
    "You are standing 1 hex away from the mountain. If 4 is rolled on the die, you will take 2 steps (an empty hex and a hex with a hill) and stop walking until your next turn. The same is when you go down." : "Вы стоите в 1 гексе от горы. Если на кубике выпало 4, вы сделаете 2 шага (пустой гекс и гекс с холмом) и оставновитесь до следующего хода. То же самое происходит, когда вы спускаетесь вниз.",

    "Unlinked objects" : "Объекти без привязки",
    "Base" : "База",
    "This type of texture does not belong to any of the previously ones. This is your faction's starting location. From here all your units begin to move. The base cannot be captured, it is unplayable zone to other players. However, units located on this territory can be attacked." : "Этот тип текстуры не принадлежит ни к одному из предыдущих. Это стартовая локация вашей фракции. Отсюда все ваши юниты начнут двигаться. Базу невозможно захватить, это неигровая зона для других игроков. Однако юниты, находящиеся на этой территории, могут быть атакованы.",



    "The game has a number of countries for which the player can play. At the beginning of the game, they are given out randomly or chosen at will, but we still recommend the first option. Each fraction has two passive skills that are always active. Study them carefully and apply them wisely." : "В игре есть ряд стран, за которые игрок может играть. В начале игры они выдаются случайным образом или выбираются по желанию, но мы все же рекомендуем первый вариант. Каждая фракция имеет два пассивных навыка, которые всегда активны. Внимательно изучите их и применяйте с умом.",

    "France" : "Франция",
    "Birth of Napoleon" : "Рождение Наполеона",
    "Any standard unit can become an artillery commander by reaching the artillery center and using their ability on the next turn." : "Любой стандартный юнит может стать командиром артиллерии, достигнув артиллерийского центра и использовав свои способности на следующем ходу.",
    "White flag" : "Белый флаг",
    "On 40 turn, France is have to transfer all its territories except the Base under German control." : "На 40-ом ходе Франция должна передать все свои территории, кроме базы, под контроль Германии.",

    "Germany" : "Германия",
    "Blitzkrieg" : "Блицкриг",
    "The movement die is rolled 2 times." : "Кубик на перемещение кидается 2 раза.",
    "Berlin capitulation" : "Капитуляция Берлина",
    "On 45 turn, all German territories except the base become neutral." : "На 45-ом ходу все немецкие территории становятся нейтральными.",

    "England" : "Англия",
    "Apple pie" : "Английский пирог",
    "All health restore cards gives a maximum of points." : "Все карточки восстановления здоровья восполняют максимум единиц.",
    "Irish Republican Army" : "Ирландская Республиканская Армия",
    "For the final scoring of territories, 2 districts (12 hexes) are not considered English." : "При финальном подсчете территорий, 2 района (12 гексов) не считаются английскими.",

    "Italy" : "Италия",
    "Papal whim" : "Папская прихоть",
    "You can declare a Crusade 4 times per game lasting 5 circles." : "Вы можете объявить Крестовый поход 4 раза за игры длительностью в 5 кругов.",
    "Mafia share" : "Доля мафии",
    "All cards for restoring ammunition are less in half, but not less than 1 point." : "Все карточки восстановления боеприпасов уменьшены вдвое, но не меньше 1-ой ед."
}
