{
    "board strategy": "настільна стратегія",

    "Home": "Головна",
    "Rules": "Правила",
    "Units": "Юніти",
    "Components": "Компоненти",
    "Fractions": "Фракції",
    "Forum": "Форум",
    "Authorization": "Авторизація",
    "Log in": "Увійти",
    "Logout": "Вийти",
    "You can visit forum only after registration": "Відвідати форум можливо тільки після реєстрації",

    "Website is developed based on personal practice" : "Сайт розроблен на основі власної практики",
    "Quick access" : "Швидкий доступ",
    "Ask author" : "Запитати автора",
    "Ask your question..." : "Задайте питання",
    "Send" : "Відправити",

    "Play!" : "Грати!",
    "Really start the game?" : "Дійсно почати гру?",
    "Yeah, let's go!" : "Так, поїхали!",
    "Nah, wait a minute" : "Ні, зачекайте хвилинку",

    "About the game" : "Про гру",
    "The game for" : "Гра для тих",
    "Those who love board games" : "Хто любить настільні ігри",
    "Those who like tactic and strategy" : "Кому подобається тактика і стратегія",
    "Those for whom the word \"union\" is not just a sound" : "Для кого слово \"союз\" не просто звук",
    "Those who determine the game length themselves " : "Хто сам визначає довжину партії",

    "enter your email": "введіть вашу пошту",
    "Remember me": "Запам'ятати мене",
    "Forgot password?": "Забули пароль?",
    "Login": "Ваш логін",
    "Email": "Ваша пошта",
    "Password": "Ваш пароль",
    "Repeat Password": "Повторіть ваш пароль",
    "Registration": "Реєстрація",
    "Your email will not use for spam": "Ваша пошта не буде використана для спаму",

    "Verify Your Email Address" : "Підтвердіть вашу email адресу",
    "A fresh verification link has been sent to your email address." : "Нове посилання для підтвердження вашого email було надіслано",
    "Before proceeding, please check your email for a verification link." : "Перед тим, як продовжити, переіврте будь-ласка вашу пошту на підтвердження вашої email адреси",
    "If you did not receive the email" : "Якщо ви не отримали email",
    "click here to request another" : "натисніть сюди для повторного відправлення",

    "Search" : "Пошук",
    "type something..." : "введіть щось...",
    "Categories" : "Розділи",
    "Create post" : "Створити статтю",
    "For Administrator" : "Адміністратору",
    "All posts" : "До всіх статей",
    "All categories" : "До всіх категорій",
    "All users" : "Керування користувачами",
    "Create category" : "Створити категорію",

    "Last themes" : "Останні статті",

    "Posts management" : "Керування статтями",
    "Title" : "Назва",
    "Administration" : "Керування",
    "Edit" : "Ред.",
    "Delete" : "Видалити",

    "Post creation" : "Створення статті",
    "Post title" : "Назва статті",
    "Post content" : "Наповнення статті",
    "Select a category:" : "Оберіть категорію",
    "Attach" : "Прикріпити",
    "Edit post" : "Редагування статті",
    "Post update" : "Оновити статтю",

    "Categories management" : "Керування категоріями",
    "Category creation" : "Створення категорії",
    "Category title" : "Назва категорії",
    "Category edit" : "Редагування категорії",
    "Update category" : "Оновити категорію",

    "Users management" : "Керування користувачами",
    "Role" : "Роль",
    "Admin" : "Адмін",
    "User" : "Юзер",
    "User update" : "Редагування користувачів",
    "User login" : "Логін користувача",
    "User name" : "Ім'я користувача",

    "Posts from: " : "Статті з категорії: ",

    "Found posts" : "Знайдені статті",

    "Introduction" : "Вступ",
    "The game invites you to plunge into a randomly developing alternative history of the World War, in which not only tactics and strategy will play a role, but also the generation of the campaign map itself. The events of the game will take place in randomly generated locations, where different countries of the world will enter the battle. Your tasks will include: destroy all enemies and/or achieve victory by any other means." : "Гра пропонує зануритися в альтернативну історію Світової війни, що випадково розвивається, в якій гратиме роль не тільки тактика і стратегія, а й генерація самої карти кампанії. Події гри відбуватимуться у довільно згенерованих локаціях, на яких до битви вступлять різні країни світу. Ваші завдання включатимуть: знищити всіх ворогів і/або досягти перемоги будь-якими іншими способами.",
    "The game includes:" : "В набір входить:",
    "«Tasks» card deck" : "Колода карток «Завдання»",
    "«Daily events» card deck" : "Колода карток «Щоденні події»",
    "«Box» card deck" : "Колода карток «Ящик»",
    "«Bunker» card deck" : "Колода карток «Бункер»",
    "«Field headquarters» card deck" : "Колода карток «Польовий штаб»",

    "«Units» card deck" : "Колода карток «Юніти»",
    "212 unit tokens of seven types" : "212 фішок юнітів семи типів",
    "128 rank stars" : "128 рангових зірок",
    "«Fraction» card deck" : "Колода карток «Фракції»",
    "50-80 capture flags in eight different colors" : "50-80 флагів захоплення восьми різних кольорів",

    "160 hexes" : "160 гексів",
    "2 six-sided dice" : "2 шестигранні кубики",
    "8 or 10 «cleared» tokens" : "8-10 жетонів «зачищено»",
    "6,360 health, armor, ammo tokens" : "6,360 жетонів здров'я, броні, боєприпасів",
    "160 stands for unit chips in eight different colors" : "160 підставок під фішки юнітів воьсми різних кольорів",

    "How to start the game" : "Як почати гру",

    "The map is presented in the form of hexes, where in one large one (called a «district») there are seven small ones (this is ordinary «earth»). Now let's start the game." : "Карта представлена у формі гексів, де в одному великому (він називається «район») розташовані сім маленьких (це звичайна «земля»). Тепер приступаємо до гри.",
    "Place hexes on the board in a random order, face down. Place decks of different types (tasks, daily events (hereinafter referred to as daily), box, bunker, field headquarters) next to the field. Now each player must choose or randomly draw a state (see below) to play for. Give everyone four basic units (see below), marked with an asterisk, which will be located at the initial «Base» location - a hex with a castle of one of eight colors. Flip the hexes on the board face up. Now you can examine the campaign map and figure out your next steps to capture it." : "Розташуйте на полі гекси у довільному порядку сорочкою вгору. Розмістіть колоди різних типів (завдання, щоденні події (далі їжачок), ящик, бункер, польовий штаб) поруч із полем. Тепер кожен гравець повинен вибрати або випадково витягнути державу (див. нижче), за яку він гратиме. Роздайте кожному по чотири базові юніти (див. нижче), помічені зірочкою, які розташовуватимуться на початковій локації «База» – гекс із замком одного з восьми кольорів. Переверніть гекси на полі вгору. Тепер можете оглянути карту кампанії та прикинути ваші подальші кроки щодо її захоплення.",

    "How to play cards" : "Як грати картами",

    "The «Task» and «Daily» cards are picked up" : "Картки «Завдання» та «Їжачки» підіймаються",
    "first at the start of your turn" : "першими на початку вашого ходу",
    "before any other action is taken, and are spoken out (see note below). " : "перед тим, як зробити будь-яку іншу дію і озвучуються (див. нижче).",

    "The first ones «cling» to the base unit and do not drop until it receives a rank or until you want to drop the task (see below). The second ones give a positive (hereinafter referred to as buff) or negative (hereinafter referred to as debuff) effect on all your soldiers at once and are postponed until the end. They are colored green (positive daily) and red (negative daily). Cards «Box», «Bunker», «Field Headquarters» are raised if you have captured the strategic point corresponding to it (see below)." : "Перші, «чіпляються» на базового юніту і не скидаються, поки той не отримає звання або поки Ви не захочете скинути завдання (див. нижче). Другі один раз дають позитивний (далі баф) або негативний (далі дебаф) ефект на всіх ваших солдатів разом і відкладаються у відбій. Вони пофарбовані зеленим (позитивні їжаки) та червоним кольорами (негативні їжаки). Картки «Ящик», «Бункер», «Польовий штаб» піднімаються в тому випадку, якщо Ви захопили стратегічну точку, що відповідає їй (див. нижче).",

    "Note:" : "Примітка:",

    "Should to note that non-basic units, that is," : "Слід зазначити, що неосновні підрозділи, тобто,",
    "special units": "особливий юніти",
    "and": "і",
    "additional units": "додаткові юніти",
    "(see below)": "(див. нижче)",
    "can not": "не можуть",
    "perform tasks. Also, tasks do not have to be completed or even taken from the deck during your unit's turn.": "виконувати завдання. Крім того, завдання не потрібно виконувати або навіть брати з колоди під час ходу вашого підрозділу.",

    "Each" : "Кожен",
    "basic unit" : "базовий юніт",
    "can reset one task once without losing points (see below)." : "має можливість скинути один раз одне завдання без втрати балів (див. нижче).",

    "It happens that some conditions in the cards will strongly conflict with the rules. Therefore, remember: the rules are certainly important to follow, but the text on the Daily cards is more important than them in meaning, and the text on the Task cards is more important than the previous ones." : "Буває таке, що деякі умови в картках сильно конфліктуватимуть із правилами. Тому запам'ятайте: правила безумовно важливі для дотримання, але текст на картках «Їжаків» важливіший за їх значення, а текст на картках «Завдання» важливіший за попередні.",

    "Start and end of the game" : "Початок і заваршення гри",

    "It is advisable to decide how long your game will last, otherwise it may last overnight. Next, decide who goes first by rolling the dice, playing rock-paper-scissors, arguing and shouting, or other methods that suit you." : "Бажано визначитися, скільки часу триватиме Ваша гра, інакше це може затягтися і на ніч. Далі вирішіть, хто ходить першим за допомогою кидка кубика, гри «Камінь-ножиці-папір», суперечками та криками чи іншими зручними Вам методами.",

    "There are different ways to win:" : "Перемогти можна різними способами:",

    "Destroy all enemies" : "Знищити всіх супротивників",
    "Win at the end of the game with the maximum number of points (see below)" : "Виграти в кінці гри, набравши максимальну кількість балів (див. нижче)",

    "The player who has lost all units is eliminated from the game." : "Гравець, який втратив всіх юнітів вибуває з гри.",


    "Game phases" : "Ігрові фази",

    "The game consists of phases. Each phase ends with the person who starting the game. One phase equal the one year. Each player, in order of his turn, takes the following actions:" : "Гра складається з фаз. Кожна фаза закінчується тим, хто починає гру. Одна фаза дорівнює одному року. Кожен гравець в порядку свого ходу здійснює наступні дії:",

    "Find out what awaits you today" : "Дізнайся, що сьогодні очікує на тебе",
    "draw one card from the «Daily events» card deck for every unit before it starts movement and announce it. For all units, fulfill the conditions that are written on the card. After completion, discard the card." : "витягніть по одній карті з колоди «Їжачки» для кожного юніта перед тим, як він почне рух, і оголосиьте їх. Для всіх юнітів виконайте умови, які написані на картці. Після завершення скиньте картку.",

    "In search of glory" : "В пошуках слави",
    "if desired, draw one card from the «Tasks» card deck and announce it. Keep the card with your unit until him will promoted or if you decide to discard the card. Once the conditions are met, discard the card." : "за бажанням витягніть одну карту з колоди «Завдання» та оголосіть її. Притримайте картку у свого юніта до моменту його підвищення, або якщо ви не вирішите скинути карту. Коли умови виконано, скиньте картку.",
    "There can be no more than" : "Не може бути більше",
    "one" : "однієї",
    "«Tasks» card" : "карточки «Завдання»",
    "on one basic unit" : "на одному базовому юніті",
    "You can not to take the «Tasks» card for non-basic units." : "Ти не можешь взяти картку «Завдання» для небазового юніта.",

    "Is it worth" : "А чи варто",
    "if there are enough hexes between your and an enemy unit, you can optionally start a battle with it (see below). If you want to avoid combat, you can simply do the number of steps that rolled on the die." : "якщо між вашим та ворожим юнітом достатньо гексів, ви можете за бажанням розпочати з ним бій (див.нижче). Якщо ви хочете уникнути бою, ви можете просто зробити ту кількість кроків, яка випала на кубику.",

    "Repeat all steps for all your units." : "Повторіть всі дії для всіх ваших юнітів.",
    "You can use only" : "Ви можете використовувати лише",
    "one die" : "один кубик",
    "for movement." : "для переміщення.",
    "Each unit can move only once at its turn." : "Кожен юніт може ходити лише один раз за свій хід.",

    "In one turn you can shoot and move." : "В один хід ви можете стріляти і рухатися.",
    "But there can not be more" : "Але на одному гексі не може бути більше",
    "than one" : "одного",
    "unit on the hex." : "юніта.",


    "Fighting system" : "Бойова система",

    "It is important to know that each unit has its own rules of engagement (see below). It should be remembered that you can only shoot at an enemy if he is standing on the same line with your one. After you will deal the damage to the enemy, the «armor» parameter will decrease first. When the «armor» parametr will reach zero, the «health» parameter will decrease next. You are obliged to strictly follow these instructions, and also not to forget possible buffs or debuffs that could be written on certain cards before you start the battle." : "Важливо знати, що кожен юніт має власні правила бою (див. нижче). Слід пам'ятати, що стріляти по ворогу можна тільки в тому випадку, якщо він стоїть на одній лінії з вашим юнітом. Після того, як ви завдасте ворогу шкоди, спочатку зменшиться параметр «броня». Коли параметр «броня» досягне нуля, далі буде зменшуватися параметр «здоров'я». Ви зобов'язані суворо дотримуватися цих інструкцій, а також не забувати про можливі бафи або дебафи, які можуть бути записані на певних картах перед початком бою.",

    "Before you shoot, make sure that there is a sufficient number of hexes between your and the enemy unit (it is different for each type of unit);" : "Перш ніж стріляти, переконайтеся, що між вашим і ворожим юнітом є достатня кількість гексів (вона різна для кожного типу юніта);",

    "You can engage in close combat if both units (yours and enemy one) are on adjacent hexes from each other;" : "Ви можете вступити в ближній бій, якщо обидва юніти (ваш і ворожий) знаходяться на сусідніх гексах один від одного;",

    "Before knife stabbing or shooting, you must roll one or two dice respectively, which will show the amount of damage and accuracy;" : "Перед ударом ножа або пострілом необхідно кинути один або два кубики відповідно, які покажуть кількість пошкоджень і точність;",

    "An accuracy die is rolled when the difference between the units" : "Кубик точності кидається, коли різниця між юнітами",
    "is greater," : "більше,",
    "than 4 hexes inclusive;" : "ніж 4 гекса включно;",

    "In knife stabbing, accuracy dice is not rolled." : "В бою на ножах кубик на точність не кидається.",

    "In the battle damage will deal as much as the amount of damage rolled on the dice. In the case of a die roll for accuracy, damage is subtracted with the difference;" : "У бою буде завдано стільки шкоди, скільки випало на кубику. У разі кидка кубика на точність пошкодження віднімається з різницею;",

    "If on the damage die rolls 5 and on the accuracy die rolls 6, then the damage will dealt in full." : "Якщо на кубику шкоди випаде 5, а на кубику точності – 6, то шкоди буде завдано в повному обсязі.",
    "If on the damage die rolls 5 and on the accuracy die rolls 4, then the difference that is missing to the maximum value of the second die is subtracted. That is: 5 damage minus 2 accuracy, we get 3 units of damage." : "Якщо на кубикушкоди випало 5, а на кубику точності – 4, тоді віднімається різниця, якої не вистачає до максимального значення другого кубика. Тобто: 5 шкоди мінус 2 точності, отримуємо 3 одиниці шкоди.",

    "In knife stabbing, both players roll the damage dice. Who roll the highest number wins. The losing unit dies. If the dice values is equal, the battle ends;" : "В битві на ножах обидва гравці кидають кубики. Перемагає той, у кого випаде найбільше число. Програвший юніт гине. Якщо значення на кубиках рівне, бій закінчується;",

    "The grenade (see below) is thrown only three hexes and can deal full damage;" : "Граната (див. нижче) кидається лише на три гекси і може завдати повної шкоди;",

    "Strategic points such as the «Bunker» and «Field Headquarters» have a buff that allows you to receive an armor bonus in the event of a firefight there. That is, the enemy's damage will be reduced (see below);" : "Такі стратегічні точки, як «Бункер» і «Польовий штаб» мають баф, який дозволяє отримати бонус до броні в разі перестрілки там. Тобто шкода супротивника буде зменшена (див. нижче);",

    "Natural objects have buffs or debuffs that gives different effects to the unit which standing or passing through them (see below)." : "Природні об’єкти мають бафи чи дебафи, які дають різні ефекти юніту, який стоїть або проходить через них (див. нижче).",

    "It is impossible" : "Неможливо",
    "to make a shot, to throw a grenade, or to melee with knife in one turn. You need to choose one thing. Whenever damage is dealt, the «armor» parameter is always decrease first, and only then the «health» parameter." : "за один хід зробити постріл, кинути гранату або битися ножем. Потрібно вибрати щось одне. Щоразу, коли завдано шкоди, спочатку зменшується параметр «броні», а лише потім параметр «здоров’я».",


    "There are several types of units in the game, which are divided into different types of forces, and also have their own special capabilities. There are seven of them in total: rifleman, stormtrooper, scout, sniper, machine gunner, pilot and artillery commander." : "У грі є декілька видів юнітів, які поділяються на різні типи військ, а також мають свої особливі можливості. Всього їх сім: стрілець, штурмовик, скаут, снайпер, кулеметник, пілот і командир артилерії.",

    "The basic units are the first 4 units that are given to you at the start of the game (rifleman, scout, machine gunner, sniper). They are marked with a star. It is worth noting that if you received a unit during the promoted, that is, you called it onto the field, then it is not basic and is indicated by a number for simplified orientation." : "Базові юніти - це перші 4 юніти, які даються вам на початку гри (стрілець, скаут, кулеметник, снайпер). Вони позначені зірочкою. Варто відзначити, що якщо ви отримали юніт під час підвищення, тобто викликали його на поле, то він не є базовим і позначається номером для спрощеного орієнтування.",
    "In order not to describe here what is already on the site, we suggest simply following the link by clicking on the circle. Yes, yes, right on the icon, or on the inscription with its name." : "Щоб не описувати тут те, що вже є на сайті, пропонуємо просто перейти за посиланням, натиснувши на коло. Так-так, прямо на іконку, чи на напис з її назвою.",

    "Texture objects, strategic points and their hidden bonuses" : "Текстурні об'єкти, стратегічні точки та їх приховані бонуси",
    "The map shows several textures that have different buffs and debuffs. Conventionally, they can be divided into: «Strategic» and «Natural». In order to take advantage of the effects of the former, you must «capture» them, that is, place your unit on a hex with this object. In each such object, except of the airfield and the artillery center, cards with buffs or debuffs are hidden. To get the effects from the second, you just need to stand on them." : "На мапі показано декілька текстур, які мають різні бафи та дебафи. Умовно їх можна поділити на: «Стратегічні» та «Природні». Щоб скористатися ефектами перших, ви повинні «захопити» їх, тобто розмістити свого юніта на гексі з цим об’єктом. У кожному такому об'єкті, крім аеродрому і артилерійського центру, заховані карти з бафами або дебаффами. Щоб отримати ефект від другого, вам просто потрібно стати на них.",

    "Fractions and their features" : "Фракції та їх особливості",
    "The game has a number of countries for which the player can play. At the start of the game, they are given out randomly or chosen at will, but we still recommend the first option. Each fraction has two features that are always active. Study them carefully and apply them wisely." : "У грі є ряд країн, за які гравець може грати. На початку гри вони видаються випадковим чином або вибираються за бажанням, але ми все одно рекомендуємо перший варіант. Кожна фракція має дві особливості, які завжди активні. Уважно вивчіть їх і застосовуйте з розумом.",
    "You may think that the features of some fractions may violate the rules. Just know that their features completely ignore all the rules and other cards, being undeniable." : "Ви можете подумати, що особливості деяких фракцій можуть порушувати правила. Просто знайте, що їхні особливості повністю ігнорують усі правила та інші карти, будучи незаперечними.",


    "What are points and what about them?" : "Що таке бали і що з ними робити?",

    "Should to recal about the points that were mentioned earlier. As stated, you can win the game if at the end you have more points than your opponents. They can be obtained in different ways. But you can also lose them. It is very important to keep track of their number and, if desired, write them down on time to facilitate calculations and fair play." : "Варто нагадати про бали, які були згадані раніше. Як було сказано, ви можете виграти гру, якщо в кінці у вас буде більше балів, ніж у ваших суперників. Їх можна отримати різними способами. Але ви також можете їх втратити. Дуже важливо стежити за їх кількістю і при бажанні вчасно записувати для полегшення розрахунків і чесної гри.",

    "What you can get points for:" : "За що можна отримати бали:",
    "The easiest and fastest way to score points is to capture enemy or neutral territories. For each captured district, you get 1 point." : "Найпростіший і найшвидший спосіб набрати очки - це захоплення ворожих або нейтральних територій. За кожну захоплену область ви отримуєте 1 бал.",
    "It will be a little more expensive to capture districts with a strategic point. For such areas you get 2 points." : "Трохи дорожче обійдеться захоплення районів зі стратегічною точкою. За такі ділянки ви отримуєте 2 бали.",
    "To capture the «district» immediately, you need to place a flag of your color on the central hex." : "Щоб негайно захопити «район», потрібно розмістити прапор свого кольору на центральному гексі.",
    "The next simple method is to mark the completion of tasks. For each completed task, you receive 1 point. In the same place where it is written about a double reward, you get 2 points accordingly." : "Наступний простий спосіб - це відмітка про виконання завдань. За кожне виконане завдання ви отримуєте 1 бал. Там же, де написано про подвійну винагороду, ви отримуєте відповідно 2 бали.",
    "And the last possible option would be to kill an enemy units. For one killed, you will get 1 point." : "І останнім можливим варіантом буде вбивство юнітів супротивника. За одного вбитого ви отримаєте 1 бал.",

    "What you can lose points for:" : "За що можна втратити бали:",
    "If your district was captured, you lose 1 point." : "Якщо ваш район був захоплений, ви втрачаєте 1 бал.",
    "If you reset tasks, you lose 5 points. But remember that 1 task can be reset without losing points." : "Якщо ви скинете завдання, ви втрачаєте 5 балів. Але пам'ятайте, що 1 завдання можна скинути без втрати балів.",
    "For an uncompleted task you lose 1 point." : "За невиконане завдання ви втрачаєте 1 бал.",
    "If you lose all your units and you eliminated from the game, your points are canceled." : "Якщо ви втрачаєте всіх своїх юнітів та вибуваєте з гри, ваші бали анулюються.",

    "Rank system and tasks" : "Система звань та завдання",
    "Tasks play an important role in the game, and there are those who can ignore the rules of the game and the «Dayli» cards. Of course, you may do not do them - it depends on your desire and desire to win. For completing each task, one point is added to your task scale. What it is?" : "Завдання відіграють важливу роль у грі, і є ті, що можуть ігнорувати правила гри та картки «Їжачки». Звичайно, ви можете їх не робити - це залежить від вашого бажання і бажання перемогти. За виконання кожного завдання до вашої шкали завдань додається один бал. Що це?",
    "This task scale directly affects the promoting system for your basic units. Every three completed tasks allow you to receive a new soldier rank. These ranks provide the opportunity to apply the effect that accompanies upon receipt. The completed task must be placed under the unit’s card, a kind of note indicating that he completed them. After you done three tasks , you must return them in the «Tasks» deck and shuffle them." : "Ця шкала завдань безпосередньо впливає на систему просування ваших базових юнітів. Кожні три виконаних завдання дозволяють отримати нове звання солдата. Ці звання дають можливість застосувати ефект, який з'являється при отриманні. Виконане завдання має бути розміщено під карткою юніта, свого роду пам'ятка про те, що він їх виконав. Після виконання трьох завдань необхідно повернути їх у колоду «Завдання» та перетасувати.",
    "Initially, each basic unit is a Private. During the game, all your units," : "На початку кожен базовий юніт є Рядовим. Під час гри всі ваші юніти,",
    "except" : "окрім",
    "extra and summoning ones, can be promoted to four ranks:" : "додаткових і призовних можуть бути підвищені на чотири звання:",
    "Sergeant" : "Сержант",
    "Captain" : "Капітан",
    "Colonel" : "Полковник",
    "General" : "Генерал",
    "After completing the task, you need to record that this unit completed the mission. As soon as three tasks have been completed, a star is placed on your unit’s card, which indicates the rank (Sergeant - 1, Captain - 2, Colonel - 3, General - 4)." : "Після виконання завдання вам потрібно зафіксувати, що цей юніт виконав місію. Після виконання трьох завдань на картці вашого юніта з’являється зірочка, яка вказує на звання (сержант – 1, капітан – 2, полковник – 3, генерал – 4).",

    "What is the advantage of ranks?" : "Який плюс від звання?",
    "Upon reaching this rank, your unit's armor is completely restored. Also, you have the opportunity to summon one rifleman to the front." : "Після досягнення цього звання броня вашого юніта повністю відновлюється. Також у вас є можливість призвати одного стрільця на фронт.",
    "Upon reaching this rank, your unit's health is fully restored. Also, you have the opportunity to summon one stormtrooper to the front." : "Після досягнення цього звання здоров’я вашого юніта повністю відновлюється. Також у вас є можливість призвати одного штурмовика на фронт.",
    "Upon reaching this rank, your unit's health and armor are fully restored. Also, you have the opportunity to summon one scout to the front." : "Після досягнення цього звання здоров’я та броня вашого юніта повністю відновлюються. Також у вас є можливість призвати одного скаута на фронт.",
    "Upon reaching this rank, you have the opportunity to call a sniper or machine gunner to the front, as well as call for an air strike on enemy troops." : "Після досягнення цього звання, ви маєте можливість призвати на фронт снайпера або кулеметника, а також викликати авіаудар по військах противника.",
    "It is important to remember that only basic units can receive ranks and draw the «Tasks» deck. Summoned and extra units do not have this ability." : "Важливо пам'ятати, що тільки базові юніти можуть отримувати звання і тягнути колоду «Завдання». Призвані та додаткові юніти не мають цієї можливості.",


    "Other game features" : "Інші особливості гри",

    "Let's quickly return to what we've covered. Rules are an undeniable part of the game. But higher in importance are: «Dailys», «Tasks» and fractions effects. Follow this carefully, and you will not have problems with the game." : "Давайте швидко повернемося до того, що ми розглянули. Правила є незаперечною частиною гри. Але вище за важливістю є: «Їжачки», «Завдання» і ефекти фракцій. Дотримуйтесь цього уважно і у вас не виникне проблем із грою.",
    "As for the time of year? There are only two of them: winter (cold) and summer (warm). Each of them lasts two phases, but the game always starts at summer. They do not carry any more gaming load other than what has already been written." : "Щодо пори року? Їх всього два: зимовий (холодний) і літній (теплий). Кожна з них триває дві фази, але гра завжди починається влітку. Більше ігрового навантаження, крім того, що вже було написано, вони не несуть.",
    "In conclusion, we would like to say that the game is full of setups and all kinds of triks. Remember that every country does not have an endless number of troops that it leads. The combat units may run out, so keep a close eye on it." : "На завершення хочеться сказати, що гра повна підставами і всілякими хитрощами. Пам’ятайте, що кожна країна не має нескінченної кількості військ, якими вона керує. Бойовий склад може закінчуватися, тому уважно стежте за ним.",
    "For a more comfortable game, treat it with humor. By the way, you are not prohibited from organizing «unions». But to betray, to stick a knife in the back or put a spoke in the wheels is always welcome. Alliances are concluded in words, but for greater realism, we recommend using a separate piece of paper so that this is clearly recorded and no one asks unnecessary questions. One has only to add that the conditions of such unions must be negotiated or spelled out and observed. There are no clear rules about this point." : "Для більш комфортної гри ставтеся до неї з гумором. До речі, вам не заборонено організовувати «союзи». Але зрадити, встромити ножа в спину чи вставити палицю в колеса завжди вітається. Союзи укладаються на словах, але для більшої реалістичності рекомендуємо використовувати окремий аркуш паперу, щоб це було чітко зафіксовано і ніхто не ставив зайвих питань. Залишається лише додати, що умови таких союзів мають бути обговорені або прописані та дотримані. З цього приводу немає чітких правил.",
    "You are the ruler, your country is your kid. Everyone who encroaches on your territory is an enemy, and these are the other players at the table. Don't trust anyone. Lead wisely and honestly. Correctly assess your chances and achieve victories." : "Ви правитель, ваша країна - ваша дитина. Кожен, хто зазіхає на вашу територію - ворог, а це інші гравці за столом. Не довіряйте нікому. Правте мудро і чесно. Правильно оцінюйте свої шанси і досягайте перемог.",
    "Well, have a good game!" : "Що ж, вдалої гри!",

    "Previous" : "Попередня",
    "Next" : "Наступна",


    "Unit's indicators and their classification" : "Показники юнітів та їх класифікація",
    "Standard units of the «infantry» type" : "Стандартні юніти типу «піхота»",
    "The rifleman" : "Стрілець",
    "only owns a rifle and a knife. Has 10 points of health and armor. The ammunition is designed for 10 shots, it fires once. The maximum firing range is 8 hexes." : "володіє тільки гвинтівкою і ножем. Має 10 од. здоров'я і броні. Боєзапас розрахований на 10 пострілів, стріляє одинично. Дальність максимального пострілу 8 гексів.",

    "The stormtrooper" : "Штурмовик",
    "wields a rifle, a knife and a grenade. Has 10 points of health and armor. The ammunition is designed for 10 shots and 1 grenade throw, it fires once. The maximum firing range is 8 hexes, the maximum grenade throw range is 3 hexes. A unit cannot throw a grenade and shoot in one turn; you need to choose one thing." : "володіє гвинтівкою, ножем та гранатою. Має 10 од. здоров'я та броні. Боєзапас розрахований на 10 пострілів та на 1 кидок гранати, стріляє одинично. Дальність максимального ураження 8 гексів, дальність максимального кидка гранати 3 гекса. Юніт не може в один хід кинути гранату та зробити постріл, потрібно обрати щось одне.",
    "The grenade can deal area damage. It will deal" : "Граната може завдавати массованого пошкодження. Вона завдасть",
    "the full amount of damage" : "максимального пошкодження,",
    "if it was thrown at one unit." : "якщо була використана проти одного юніта.",
    "However, if it was used against several units, then those adjacent to the main enemy unit" : "Якщо ж, вона була використана проти кількох юнітів, то сусідні від основного ворожого юніту",
    "will receive half the damage" : "отримають половину пошкодження",
    "that received first." : "від пошкодження першого.",
    "Example:" : "Приклад:",
    "If you throw a grenade at three units (at the central one), and the die rolls 5, then the central one gets all 5 damage points, and those adjacent to it will get 3 damage points (cuz of rounded up)." : "Якщо ви кидаєте гранату в трьох юнітів (цілючись в центрального) і на кубику випадає 5, то центральний отримує всі 5 очок пошкодження, а сусідні з ним отримують 3 очок пошкодження (через округлення до більшої цифри).",

    "The scout" : "Скаут",
    "wields an auto-rifle and a knife. Has 10 points of health and armor. The ammunition is designed for 10 burst shots, using 1 shot each. The maximum firing range is 5 hexes. Has the ability to distribute damage across units if they are in the affected area." : "володіє автоматом і ножем. Має 10 од. здоров'я і броні. Боєкомплект розрахований на 10 пострілів чергами по 1 пострілу. Максимальна дальність ураження становить 5 гексів. Має здатність розподіляти шкоду між юнітиами, якщо вони знаходяться в зоні ураження.",
    "You are fighting against a group of three enemy units. When you roll the die, you get 5. Now you have the opportunity to distribute this damage across all enemies, if they are close to each other. For example, to the first - 2 damage points, to the second - 2 damage points, to the third - 1 damage points. At the same time, you need to remember that they must be on hexes adjacent to the main enemy target, and this target itself must be on the same line with your unit." : "Ви воюєте проти групи з трьох ворожих юнітів. Коли ви кидаєте кубик, вам випадає 5. Тепер у вас є можливість розподілити цю шкоду між усіма ворогами, якщо вони знаходяться поруч один з одним. Наприклад, першому - 2 од. шкоди, другому - 2 од. шкоди, третьому - 1 од. шкоди. При цьому потрібно пам'ятати, що вони повинні знаходитися на гексах, прилеглих до основної ворожої цілі, а сама ця ціль повинна знаходитися на одній лінії з вашим юнітом.",

    "Special units of the «infantry» type" : "Спеціальні юніти типу «піхота»",

    "The sniper" : "Снайпер",
    "belongs to the" : "належить до",
    "special units." : "спеціальних юнітів.",
    "Wields a sniper rifle and a knife. Has 10 points of health and armor. The ammunition is designed for 10 shots, fired once. Maximum firing range is 12 hexes. Has the ability to hit an opponent without rolling an accuracy die." : "Володіє снайперською гвинтівкою і ножем. Має 10 од. здоров'я та броні. Боєкомплект розрахований на 10 пострілів, стріляє одинично. Максимальна дальність ураження 12 гексів. Має здатність вразити супротивника, не кидаючи кубика на точність.",

    "The machine gunner" : "Кулеметник",
    "He wields a machine gun and a knife. Has 10 points of health and armor. The ammunition is designed for 10 burst shots, using 1 shot each. The maximum firing range is 6 hexes. Has the ability to deal double damage to one enemy or deal normal damage to several enemies." : "Володіє кулеметом та ножем. Має 10 од. здоров'я та броні. Боєзапас розрахований на 10 пострілів чергами, використовуючи 1 од. боєзапасу. Максимальна дальність ураження 6 гексів. Має здатність завдавати подвійної шкоди одному ворогу або наносити звичайну шкоду кільком ворогам.",
    "You are fighting against a group of 3 enemy units. When you roll the die, you get 6. Now you have a choice: duplicate the number and deal 12 damage points to any unit, or deal the usual 6 damage points to all three. At the same time, you need to remember that they must be on hexes adjacent to the main enemy target, and this target itself must be on the same line as your unit." : "Ви воюєте проти групи з трьох ворожих юнітів. Коли ви кидаєте кубик, вам випадає 6. Тепер у вас є вибір: продублювати число і завдати 12 од. пошкоджень будь-якому юніту або завдати звичайних 6 од. пошкоджень усім трьом. При цьому потрібно пам'ятати, що вони повинні знаходитися на сусідніх гексах з основною ціллю, а ця ціль повинна знаходитися на одній лінії з вашим юнітом.",

    "Extra units of the «infantry» type" : "Додаткові юніти типу «піхота»",

    "The pilot" : "Пілот",
    "extra units." : "додаткових юнітів.",
    "He wields a pistol and a knife. Has 10 health points. The ammunition is designed for 1 shot, it fires once. The maximum firing range is 5 hexes. Has the ability to call an airstrike from the airfield (see below) to any point on the campaign map. The airstrike is carried out on 1 or more hexes in a row, depending on the number on rolled die. Deals 4 damage points to those hexes that were selected. After using his ability, the pilot disappears from the campaign map." : "Володіє пістолетом і ножем. Має 10 очок здоров'я. Боєприпас розрахований на 1 постріл, стріляє одинично. Максимальна дальність ураження становить 5 гексів. Має можливість викликати авіаудар з аеродрому (див. нижче) у будь-яку точку на карті кампанії. Авіаудар виконується по 1 або більше гексів у ряд, залежно від числа на кинутому кубику. Завдає 4 од. пошкодження тим гексам, які були обрані. Після використання своєї здатності пілот зникає з карти кампанії.",

    "The artillery commander" : "Командир артилерії",
    "He wields a pistol and a knife. Has 10 health points. The ammunition is designed for 1 shot, it fires once. The maximum firing range is 5 hexes. Has the ability to call an artillery strike from the artillery center (see below) to any point on the campaign map. An artillery strike inflicts 6 damage points on a hex of your choice and 4 damage points on hexes in contact with it." : "Володіє пістолетом і ножем. Має 10 очок здоров'я. Боєприпас розрахований на 1 постріл, стріляє одинично. Максимальна дальність ураження становить 5 гексів. Має можливість викликати артилерійський удар з артилерійського центру (див. нижче) у будь-яку точку на карті кампанії. Артилерійський удар завдає 6 од. пошкоджень обраному вами гексу та 4 од. пошкоджень гаксам, які з ним контактують.",



    "Game components" : "Ігрові компоненти",

    "Strategic points" : "Стратегічні точки",

    "Boxes" : "Ящики",
    "belong to" : "належать до",
    "strategic points" : "стратегічних точок",
    "There can be up to 8-10 boxes on the campaign map. If opened, the box remains open until all the remaining ones are opened. After use, a card from the corresponding deck is shuffled with the others and put back." : "На карті кампанії може бути до 8-10 ящиків. У разі відкриття коробка залишається відкритою, доки не відкриються всі інші. Після використання картку з відповідної колоди перемішують з іншими та повертають назад.",
    "Boxes may contain cards with varying amounts of health, armor, or ammo replenishment. Also there are empty ones." : "Ящики можуть містити картки з різною кількістю запасів здоров’я, броні або боєприпасів. також є порожні.",

    "Bunkers" : "Бункери",
    "There can be up to 4 bunkers on the map. After use, a card from the corresponding deck is shuffled with the others and put back. If you are attacked while you are in the bunker, you receive a damage reduction of 3 points, but this does not apply to the grenade. The opportunity to recapture the bunker will only appear when the previous invaders move away from it on 3 hexes." : "На карті може бути до 4 бункерів. Після використання, картку з відповідної колоди перемішують з іншими та повертають назад. Якщо вас атакують, коли ви перебуваєте в бункері, ви отримуєте зменшення шкоди на 3 од., але це не стосується гранати. Можливість захопити бункер з'явиться лише тоді, коли попередні загарбники відійдуть від нього на 3 гекса.",
    "After capturing this strategic point, during the next 3 turns," : "Після захоплення цієї стратегічної точки під час наступних кількох ходів",
    "you must to" : "ви повинні",
    "withdraw your unit to the distance specified above." : "відвести свого юніта на вказану вище відстань.",
    "Bunkers may contain cards with varying amounts of health, armor, or ammo refills and negative cards that can deals damage to you. Also there are empty ones. But unlike the boxes, an extra unit can be found here, which will come under your command." : "Бункери можуть містити карти з різною кількістю поповнення запасів здоров’я, броні чи патронів, а також негативні карти, які можуть завдати вам шкоди. Також є порожні. Але на відміну від ящиків, тут можна знайти додаткового юніта, який перейде під ваше командування.",
    "If you find an extra unit, it starts moving from any hex next to the bunker." : "Якщо ви знайдете додаткового юніта, він почне рух з будь-якого гексу поруч з бункером.",

    "Field headquarters" : "Польові штаби",
    "There can be up to 2 field headquarters on the map. After use, a card from the corresponding deck is shuffled with the others and put back. If you are attacked while you are in the Field headquarters, you receive a damage reduction of 1 points, but this does not apply to the grenade The opportunity to capture the field headquarters again will appear only when the previous invaders move away from it on 6 hexes.": "На карті може бути до 2 польових штабів. Після використання картку з відповідної колоди перемішують з іншими та повертають назад. Якщо вас атакують, коли ви перебуваєте в польовому штабі, ви отримуєте зменшення шкоди на 1 од., але це не стосується гранати. Можливість знову захопити польовий штаб з’явиться лише тоді, коли попередні загарбники відійдуть від нього на 6 гексів.",
    "Field headquarters may contain cards with varying amounts of health, armor, or ammo refills and negative cards that can deals damage to you. Also there are empty ones. But unlike the boxes and bunkers, a special unit can be found here, which will come under your command.": "Польові штаби можуть містити карти з різною кількістю поповнення запасів здоров’я, броні чи патронів, а також негативні карти, які можуть завдати вам шкоди. Також є порожні. Але на відміну від ящиків та бункерів, тут можна знайти спеціального юніта, який перейде під ваше командування.",
    "If you find a special unit, it starts moving from your Base.": "Якщо ви знайдете спеціального юніта, він почне рух з вашої Бази.",

    "Airfield" : "Аеродром",
    "is belong to" : "належить до",
    "special strategic points" : "спеціальної стратегічної точки",
    "There can only be 1 on the map. In order to open it, you will need to «investigate» a secret texture marked with a question mark, which can be located in any given location. The airfield can be captured and its opening will become known to all players. The pilot needs to get to it, where he can use his ability." : "На карті може бути лише 1. Щоб відкрити його, вам потрібно буде «дослідити» секретну текстуру, позначену знаком питання, яка може бути розташована в будь-якому місці. Аеродром можна захопити, і про його відкриття стане відомо всім гравцям. Пілоту потрібно дістатися до нього, де він зможе застосувати свою здібність.",

    "Artillery center" : "Артилерійський центр",
    "There can only be 1 on the map. In order to open it, you will need to «investigate» a secret texture marked with a question mark, which can be located in any given location. The artillery center can be captured and its opening will become known to all players. The artillery commander needs to get to it, where he can use his ability." : "На карті може бути лише 1. Щоб відкрити його, вам потрібно буде «дослідити» секретну текстуру, позначену знаком питання, яка може знаходитися в будь-якому місці. Артилерійський центр можна захопити, і про його відкриття стане відомо всім гравцям. Командиру артилерії потрібно дістатися до нього, де він зможе застосувати свою здатність.",

    "Natural objects" : "Природні об'єкти",

    "Trees" : "Дерева",
    "These types of locations are" : "Ці типи локацій є",
    "natural objects" : "природними об’єктами",
    "They can be located anywhere on the map. If you were attacked while you were in the forests, the enemy receives a reduction in accuracy by 2 points (does not apply to the sniper). Moving along them is a maximum of 1 hex. Need to move carefully so you should not be noticed you know." : "Їх можна розташувати будь-де на карті. Якщо на вас напали, коли ви були в лісі, противник отримує зниження влучності на 2 од. (не поширюється на снайпера). Рухатись по ним можна тільки по 1 гексу. Потрібно рухатися обережно, щоб вас не помітили.",

    "Water heks" : "Водні гекси",
    "They can be located anywhere on the map. If you cross these places in the frosty hour (cuz the water freezing) there is no loss of moves. If you cross them in warm weather, then when descending into the water and when ascending to the shore, you lose all the remaining moves." : "Їх можна розташувати будь-де на карті. Якщо перетинати ці місця в морозну пору року (через замерзання води) втрат ходів не буде. Якщо ви перетинаєте їх в теплу пору року (див. примітку нижче), то при спуску у воду і при підйомі на берег ви втрачаєте всі ходи, що залишилися.",
    "You are standing 1 hex away from the water. If 4 is rolled on the die, you will take 2 steps (an empty hex and a hex with water) and stop walking until the next turn. The same is when you go ashore." : "Ви стоїте на відстані 1 гексу від води. Якщо на кубику випало 4, ви зробите 2 кроки (порожній гекс і гекс з водою) і зупинитесь до наступного ходу. Те саме, коли виходите на берег.",
    "If you will do the same thing but in frosty time, you just do your 4 steps from 4 rolled on the die." : "Якщо ви будете робити те ж саме, але в морозну пору, ви просто зробите свої 4 кроки з 4 викинутих на кубику.",

    "Mountains or hills" : "Гори чи пагорби",
    "They can be located anywhere on the map. You get an increase in firing range by 1 unit if you stand on them. In winter, it is not possible to walk in the mountains, because mountains are harsh places. If winter finds your unit on the mountain, it immediately dies. In case when you crossing a mountain ridge, you lose all remaining steps (see below). But if you move along a mountain range, then there is no loss of steps while moving." : "Їх можна розташувати будь-де на карті. Ви отримуєте збільшення дальності ураження на 1 од., якщо ви стоїте на них. Взимку не можна ходити в гори, тому що гори суворі місця. Якщо зима застає вашого юніта на горі, він негайно помирає. Якщо ви перетинаєте гірський хребет, ви втрачаєте всі кроки (див. нижче). Але якщо рухатися по гірському масиву вздовж, то втрати кроків при русі немає.",
    "You are standing 1 hex away from the mountain. If 4 is rolled on the die, you will take 2 steps (an empty hex and a hex with a hill) and stop walking until your next turn. The same is when you go down." : "Ви стоїте за 1 гекс від гори. Якщо на кубику випало 4, ви зробите 2 кроки (порожній гекс і гекс з пагорбом) і зупинитесь до наступного ходу. Те саме, коли ви спускаєтесь.",

    "Unlinked objects" : "Об'єкти без прив'язки",
    "Base" : "База",
    "This type of texture does not belong to any of the previously ones. This is your faction's starting location. From here all your units begin to move. The base cannot be captured, it is unplayable zone to other players. However, units located on this territory can be attacked." : "Цей тип текстури не відноситься ні до одного з попередніх. Це початкове розташування вашої фракції. Звідси всі ваші юніти починають рух. Базу неможливо захопити, вона не є ігровою зоною для інших гравців. Однак підрозділи, розташовані на цій території, можуть бути атаковані.",



    "The game has a number of countries for which the player can play. At the beginning of the game, they are given out randomly or chosen at will, but we still recommend the first option. Each fraction has two passive skills that are always active. Study them carefully and apply them wisely." : "У грі є ряд країн, за які гравець може грати. На початку гри вони видаються випадковим чином або вибираються за бажанням, але ми все ж рекомендуємо перший варіант. Кожна фракція має дві пасивні навички, які завжди активні. Уважно вивчіть їх і застосовуйте з розумом.",

    "France" : "Франція",
    "Birth of Napoleon" : "Народження Наполеона",
    "Any standard unit can become an artillery commander by reaching the artillery center and using their ability on the next turn." : "Будь-який стандартний юніт може стати командиром артилерії, досягнувши артилерійського центру та використавши свої здібності на наступному ході.",
    "White flag" : "Білий флаг",
    "On 40 turn, France is have to transfer all its territories except the Base under German control." : "На 40-му ході Франція повинна передати всі свої території, крім бази, під контроль Німеччини.",

    "Germany" : "Німеччина",
    "Blitzkrieg" : "Бліцкріг",
    "The movement die is rolled 2 times." : "Кубик на переміщення кидається 2 рази.",
    "Berlin capitulation" : "Капітуляція Берліна",
    "On 45 turn, all German territories except the base become neutral." : "На 45-му ході всі німецькі території, окрім бази, становляться нейтральними.",

    "England" : "Англія",
    "Apple pie" : "Англійський пиріг",
    "All health restore cards gives a maximum of points." : "Усі картки поповнення здоров'я дають максимальну кількість одиниць.",
    "Irish Republican Army" : "Ірландська Республіканська Армія",
    "For the final scoring of territories, 2 districts (12 hexes) are not considered English." : "При фінальному підрахунку територій, 2 райони (12 гексів) не рахуються англійськими.",

    "Italy" : "Італія",
    "Papal whim" : "Папська примха",
    "You can declare a Crusade 4 times per game lasting 5 circles." : "Ви можете оголосити Хрестовий похід 4 рази за гру тривалістю 5 кіл.",
    "Mafia share" : "Доля мафії",
    "All cards for restoring ammunition are less in half, but not less than 1 point." : "Всі картки поповнення боєкомплекту зменшені в половину, але не менша 1-єї од."
}
